[
    {
        "title": "Fire on campus",
        "score": 150,
        "date": "01-13-2025",
        "url": "https://i.redd.it/tuvfw5l48uce1.jpeg",
        "num_comments": 21,
        "comments": [
            "Fires are so hot right now"
        ],
        "replies": [
            "Oof, not good. I got passed by the ladder truck on Brooks and assumed it must be a bigger fire/structure",
            "Which building is that? I’ve been on campus maybe twice so forgive my ignorance",
            "Everywhere I go, there are fires.",
            "They had it out quick maybe 15 mins max from start to finish",
            "Damn when did that start? I was there like 3 or 4 hours ago and no issues.",
            "What's the wind forecast?",
            "Is this not the Forestry building? It's been awhile for me",
            "[deleted]",
            "I believe it’s the new power plant building",
            "Looks like the heat/power plant",
            "that's suspicious...",
            "About 3:30pm",
            "We have enough snow, to the point where it shouldn’t matter",
            "Nope, the heating plant is in between the stadium and Aber hall on the northeast side of campus. Forestry is on the opposite side of campus.",
            "Did they?",
            "Northwest Energy sends their regards.",
            "New expansion of existing power plant, it’s a steam plant and they added the ability to produce their own electricity something like 90% of the campus gets their electricity from there now.",
            "You are right it’s the steam plant!",
            "Heat plant?  Appears to be working.",
            "For some places- the pool is closed and practice is canceled today.",
            "I just meant that if there's fire, then there indeed must be heat."
        ]
    },
    {
        "title": "fire at rose garden park",
        "score": 2,
        "date": "12-08-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1h98lz7/fire_at_rose_garden_park/",
        "num_comments": 9,
        "comments": [
            "Flag retirement. https://www.facebook.com/share/p/1As8ehDSKx/?mibextid=oFDknk"
        ],
        "replies": [
            "It's a disposal ceremony and the correct way to retire an American flag.\n\nBegin a Flag burning ceremony by folding the whole Flag in its customary manner. Next, start a fire large enough to completely burn the Flag and respectfully place the Flag into the fire. The Flag should not touch the ground in the process.\n\nAs the Flag begins to burn, salute the flag, say the Pledge of Allegiance, and pause for a moment of silence. The Flag should be thoroughly burned so that nothing besides ashes are left. Finally, bury the ashes",
            "They were burning American flags! We drove around the back side of the park after seeing what I thought was a flag burning, and sure enough! A bunch of people in line holding flags and putting them in the fires! I got on here to see what the hell was going on!? Somebody please fill us in! ",
            "Honest question here... what is the reason for retiring and burning a flag? Why not just keep it?",
            "God bless our country, and I’m forever greatful for the people who gave the ultimate sacrifice for my freedom and rights!",
            "based",
            "When a flag is too tattered it lacks the dignity and pride it represents. So retiring is nice so it can finally die. Could you imagine if our flags weren’t incinerated and there were just clippings and pieces everywhere, on the ground, in the garbages? Being surrounded by flags that are clinging for life would kind of reflect that on the state of our nation.",
            "Too true right now!",
            "Yah in line with that, we don’t really have enough of our flag raised high. It’s always at half mast or upside down or bastardized by thin blue line or punisher skull bullcrap"
        ]
    },
    {
        "title": "Controlled fire or?",
        "score": 42,
        "date": "11-27-2024",
        "url": "https://i.redd.it/hy1rs2ahmc3e1.jpeg",
        "num_comments": 8,
        "comments": [
            "I know there’s some prescribed burns happening in Lolo, could be happening out in Bonner too. "
        ],
        "replies": [
            "Grandma burned the damn turkey again",
            "bunch of slash piles they waited to burn",
            "Yeah, that’s a burn line. \n\nIgnore it.",
            "Damn trains caught on fire again.",
            "Get it out next thing we know they will want to mine some mineral there.",
            "Noo... it's a raging forest fire....",
            "Doubt it’s intentional"
        ]
    },
    {
        "title": "Fire up Pattee Canyon",
        "score": 6,
        "date": "11-24-2024",
        "url": "https://i.redd.it/y0dd9icadw2e1.jpeg",
        "num_comments": 6,
        "comments": [
            "It’s burn season"
        ],
        "replies": [
            "Controlled burn up pattee canyon",
            "Slash piles, nothing new at all",
            "Either undergrowth clearing or slash piles.",
            "Controlled burn probably",
            "it's fire season 🤷‍♂️"
        ]
    },
    {
        "title": "Fire Near The Wye?",
        "score": 1,
        "date": "10-27-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1gdiwe0/fire_near_the_wye/",
        "num_comments": 0,
        "comments": [],
        "replies": []
    },
    {
        "title": "Renting Firearms and firing range recommendations in Mussoula",
        "score": 0,
        "date": "10-09-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1fzocdk/renting_firearms_and_firing_range_recommendations/",
        "num_comments": 18,
        "comments": [
            "[Northwest Shooter - (406) 892-0377](https://www.northwestshooter.com/)"
        ],
        "replies": [
            "Consider a gun safety course so at least you know you’re learning how to safely handle a gun before going all Westworld during your much anticipated honeymoon. Have fun and play safe!",
            "There are rental ranges other places, but just not here in Missoula. We do have ranges, but they are the bring your own variety.  \n\nYour best bet is to either try to connect with someone with a membership and equipment who will take you out, and/or visit Bozeman, as I think they have one.  Bozeangeles is the home of the plastic cowboy….",
            "It’s not a thing",
            "When do you plan on visiting?",
            "[deleted]",
            "I can hook you up. If you pay for the ammo, I'll let you shoot the 82A1 Barrett .50, suppressed Glocks, Uzis, and whatever else you want.",
            "There isn’t really an indoor range place here unfortunately. Bozeman has one that I’ve been to and it was pretty nice. Spending time in each place would be nice, and the drive is scenic. Are you flying into Missoula?",
            "[https://www.reddit.com/r/missoula/comments/13v0cu6/shooting\\_ranges\\_which\\_offer\\_rentals/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/missoula/comments/13v0cu6/shooting_ranges_which_offer_rentals/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "Damn, Missoula needs a place like this.",
            "Very cool. Thanks for the recommendation.",
            "Yeah, great point. I have experience but that was over a decade ago so probably worth brushing up!",
            "Most ranges that offer rentals have instructors on site for newbies.",
            "I have a membership at the local range and a decent variety of guns. I might be willing to help you out.",
            "Yeah, seems like the best bet. Thanks for the advice!",
            "Yes, someone recommended a place in Bozeman. We're going to look at shifting our itinerary to include a day up there. Thanks!",
            "Not until next summer, so we've got time to make adjustments. Current bet is to look at staying a nite in Bozeman to try out a range someone recommended.",
            "We're looking at a day in Bozeman as someone else made the really great point of a safety course prior to hitting the range."
        ]
    },
    {
        "title": "Giant pillar of smoke behind super walmart",
        "score": 16,
        "date": "09-19-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1fka2f7/giant_pillar_of_smoke_behind_super_walmart/",
        "num_comments": 13,
        "comments": [
            "Viva la revolution!"
        ],
        "replies": [
            "Drove back there and it was in the forest on the other side of the road. Not sure what was on fire, but it had to of been big due to the amount of smoke. I could smell it on Rodgers st even when I got home.",
            "There are a couple warwagon RVs parked behind the store. Maybe one caught fire.",
            "Did somebody go light the compost piles? Or is a homeless camp fire out of control?",
            "Probably the homeless lighting things on fire again. It happens like twice a year down there.",
            "I saw 2 teen boys come from back that direction on those mini motor bikes then were popping wheelies in the Walmart parking lot right before the fire department showed up.",
            "It's somewhere closer to eco compost, i know that much",
            "[removed]",
            "Oh yikes! Yeah there was a ton of smoke",
            "Same thing",
            "Twice a year is very generous. Jacob’s island has caught ablaze like four times already this year alone",
            "FYI This sub has no sense of humor or rhetoric btw"
        ]
    },
    {
        "title": "Good places to smoke🔥🍃?",
        "score": 0,
        "date": "09-14-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1fgx7un/good_places_to_smoke/",
        "num_comments": 13,
        "comments": [
            "Roll a phatty \nHead up Pattee"
        ],
        "replies": [
            "Literally anywhere",
            "I",
            "Lots of people smoke while playing disk golf in Patty canyon or blue mountain. Most of the trails with views are pretty popular, so I would maybe recommend ducking off the trail a bit when you smoke. Just so that you don't accidentally blow smoke in someone's path. But good views would be the L the M and water works. There is also the baymar (maybe spelled that wrong) on the right going into Patty that has a good view. If you download the alltrails app they are a decent resource for finding cool spots.",
            "You’ll honestly be fine smoking anywhere especially if nobody is around to potentially bother you. One of my favorite areas is past the Kona Bridge, you follow the dirt road all the way up into the mountains and it will eventually lead you to Deep Creek, it can be a bit of a sketchy road if you car doesn’t have great clearance but you can park right next to the Clark Fork River and usually there’s very few people, often times empty! It can be a popular place for people to party at night but during the day time it’s a large enough area that literally no one will give a shit about what you’re doing.",
            "Anywhere on Ryman street",
            "[deleted]",
            "Try macclay flats, blue mountain, some of the parks along the river downtown when its later at night and no families are around",
            "Kelly island has some great spots.  So does the Tower st access spot.   Mill town st park overlook has a picnic table that overlooks the confluence and nobody ever goes there.",
            "Just before the road switches back onto the other side of the canyon there's a pullout on the right you can park in.  Walk back towards pattee a hundred yards or so and there's a waterfall you can hike down to and sit in the middle of. 10/10 smoke spot.",
            "Barmeyer is the trail going into patty",
            "Blue mountain for sure is federal land, don't know about pattee canyon. But while getting caught for smoking there is rare, it's going to suck when a forest service guy rolls through.",
            "well i probably wouldn’t be looking on reddit😭 i’m not 21 yet either so",
            "The chances of a BLM agent giving you a possession charge are rediculously low."
        ]
    },
    {
        "title": "Don't let smoke or rain keep you from having fun this weekend! ",
        "score": 7,
        "date": "09-12-2024",
        "url": "https://i.redd.it/27paimhzaeod1.png",
        "num_comments": 5,
        "comments": [
            "I love smoking in the rain"
        ],
        "replies": [
            "This weekend should actually be great weather.  Rain will clear out the smoke and weather should be awesome for the griz game.  And sunday is looking great too!",
            "Saturday 11am-4pm is the opening of the demonstration garden at the Fairgrounds. ",
            "Sunday is Sunday Streets Mussoula, music, etc, U district. ",
            "If you like Pina Coladas.. And getting high in the rain"
        ]
    },
    {
        "title": "Question for High-energy dog parents in the smoke",
        "score": 23,
        "date": "09-09-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1fcxhgj/question_for_highenergy_dog_parents_in_the_smoke/",
        "num_comments": 31,
        "comments": [
            "We keep our Aussie in as much as possible when it gets this bad but again to each there own, if I personally don’t want to breath the air or be outside I’m sure they don’t as well"
        ],
        "replies": [
            "I don't walk my dogs in the extreme smoke personally. Yes it sucks. Having them sniff things indoors like tea bags, puzzles, mental stimulation can help. God speed.",
            "We have puzzles that we have for our dog. Its not the same as 6 miles running around. But it is stimulus and it does exhaust our dog..He is a very high maintenance dog when he can’t burn energy. This is a way we have found that we can do this indoors..\n\nFrozen carrots, or healthy food treats hidden in these puzzles where they have to figure out how to get them keeps our dog very occupied",
            "We’re staying inside and the dogs are losing their minds.  Puzzles are good, working on training, like learning tricks or advanced twists on obedience, are good.  Hide and seek with treats (hide treats throughout the house, let dogs find them) also works.",
            "Give the dog a bath it can release energy in some dogs and relax others.",
            "Deeogee on reserve has puzzles too. You can also diy some pretty good ones with cardboard boxes, towels, and other household goodies. r/dogtraining has some good threads of ideas if you search there.",
            "I was going to ask this exact question. I’m wary of letting my dog out in the yard for too long since it’s so bad. I’m going to try and throw around toys and stuff too",
            "Walking pad (my dog HATES that), I have stairs and we play fetch up and down the stairs (doggy stairmaster) we will go walk in dog friendly indoor places (she LOVES this) and lots of mental stimulation.  Occasionally we will get out of the valley for an adventure if somewhere reasonably close has better air quality. \n\nGenerally a combo of these things help.  Not a substitute for the daily walk, but enough to keep them from being a twitchy PIA",
            "Here's a great list of indoor enrichment! https://www.reddit.com/r/dogs/s/KI0u694rWa",
            "We're just staying inside and throwing toys around the living room mostly. He'll be fine. They don't need hard exercise absolutely every day.",
            "They had them at Toifers on Higgins, and my wife bought a few on Amazon",
            "Hide and seek with toys or treats, any kind of mental stimulation will help.",
            "I keep mine in on these kinds of days, it’s not worth it. We have a dogpacer treadmill we use if he needs a physical outlet that has been an absolute joy to have in these kind of extreme weather situations. Otherwise we do puzzle games, training sessions, and frozen enrichment to wear him out as much as possible on indoor only days!",
            "Short walks just to get smells. More indoor ball throwing and tug of war. Brought a friend's playful dog over so they would wrestle and chew on each other in the house (exhausting for me, but oh well.) I may pay for him to go to doggy day care for a day of play.",
            "We're generally staying inside. Lots of petfriendly stores to walk in in Missoula as well. Super awesome way to get some mental stimulation rather than walking 6 miles in the store. We usually pick a high traffic area to hang out (my guy is lacking some confidence though, so this is also a good training experience) \n\nI also usually end up buying something so I feel like less of a loiterer, but most stores have never said anything, especially in cold or smoky weather like this.",
            "I have an English Setter w/similar energy levels but we only do very short walks when smoke is bad. He gets sick like me when he’s out in it so remember the smoke’s not good for our pets either. We just play games indoors and go out for potty breaks until air quality improves. It really sucks I must say😮‍💨😮‍💨",
            "I walk my dog on leash 1/4 to 1/2 mile.   so they get a little taste of the outside but don't breathe as deeply as they would exerting themselves more.",
            "Car rides with air conditioning on recirculate might be an option if your dog finds it interesting and you are willing  / able to burn more fuel / electricity.",
            "There used to be an indoor dog park... RIP Go Fetch.",
            "Holy shit it’s nice outside when everyone and there dogs stay in!",
            "A 3M respirator with P100 filters works pretty good for not feeling sick after exercise outdoors during hazardous particulate counts.\n\nAs for your dog’s health it is up to you.\n\nMy dog isn’t wanting to stay out in the yard as much as usual today.\n\nHope you can find a good compromise.",
            "Hmm hurt your dog's feelings for a couple days and don't go for a walk or risk your dogs health, tough decision",
            "Damn, I wanna smell mental stimulation, too",
            "Another option too is rolling treats up in towels if you don’t have the puzzles on hand. As a side note, even though we bought a couple puzzles for our dogs (Outward Hound brand), our cat loves them so we now use one with our indoor cat for regular feeding.",
            "Where did you get the puzzles? I’m very interested. Thank you.",
            "Too true! In fact, it is beneficial to take one or two days a week off. This is true for professional human athletes too.",
            "We used to do this, The towel game was great because there was so much you could do with it! \n\nSwirl it like you would a tie dye for easy mode. tuck, fold and tie for hard mode",
            "TJ Maxx has them in the pet section occasionally.",
            "You can look on Amazon, the local pet store, or even Pinterest. Pinterest has some cute ideas with items you might already have in the home! Enjoy!",
            "Thank you!",
            "Thank you!"
        ]
    },
    {
        "title": "Smoke, air quality and fire map",
        "score": 21,
        "date": "09-09-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1fcqspn/smoke_air_quality_and_fire_map/",
        "num_comments": 6,
        "comments": [
            "The person here also interprets and writes about fire/smoke each summer. Plus they’re sometimes funny as hell and always interesting. \n\nhttps://www.missoulacounty.us/government/health/health-department/home-environment/air-quality/current-air-quality"
        ],
        "replies": [
            "The smoke plume layer is pretty interesting.",
            "Also a good app called Watch Duty to see fires, containment, growth, etc",
            "The smoke is coming from fire",
            "Do we really need 12 Smoke threads/subs etc?",
            "I could go for a few more"
        ]
    },
    {
        "title": "Forest fire question ",
        "score": 0,
        "date": "09-08-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1fbr9kz/forest_fire_question/",
        "num_comments": 25,
        "comments": [
            "Forest fires are a natural part of forest development so it won’t just “burn out” in the next 20-30 years.  The burning of plant matter returns to the soil and actually helps develop the next biological life that then grows from the earth.  Natural selection helps certain species of plants survive fires too, like Ponderosa pines don’t group together as close as a Doug Firs and avoid all burning together.  These are the basics I remember from middle school camping field trips."
        ],
        "replies": [
            "Smoke will stick around until we get some decent weather change (it gets colder regularly, lots of rain WITHOUT wind or lightning, early snow) fires will smolder and burn till snow flies.\n\nplan for the smoke to stick around until the first consistent week of having breaking out the scraper in the AMs. \n\nSo if we have a warm fall, yeah…. Another month. Then we get a nice little break, and the winter inversions start (not smoke, but air quality can be just as bad) PLUS we get the joys of slick icy roads that don’t get plowed. \n\nIf it’s really bothering you probably go see your doc and get an inhaler.\n\nETA: PS no, something somewhere will burn every summer.  We get smoke locally, and from Canada, Washington, ID, OR.  It collects in the valley.  About the time you think you should be in the clear the same mountain burns again.  Hellgate Canyon/ Sentinel burned a little this year. Some idiot sets the grassy side of sentinel on fire every 10 ish years, and the canyon was a rager in the mid 80s.",
            "It happens often, but it's not constant. We had a pretty good first half of the summer, so no complaints from me.\n Obviously, no smoke would be best, but that's just life here.\n\nIt's mostly a summer thing, so it will get better. Later we can get anxiety from the icy roads instead of the smoke.",
            "Big change in the weather coming Wednesday/Thursday, should knock the smoke back for awhile.",
            "The only way I’ve been able to live here long-term with asthma was to invest in HEPA filters for every room in my house and limit outdoor activity when the AQI starts getting into the 80’s. Think of smoke exposure as accumulative - the less you are exposed to over time the better, especially if you are sensitive. ",
            "Missoula has been rated one of the places with the worst air quality in the country. This is normal for here and will impact your health in the long term. Fire season goes from July until the first good snows in November.\n\nhttps://www.mtpr.org/montana-news/2018-04-18/missoula-air-lands-on-list-of-most-polluted",
            "Lived in Missoula for 13 years - never had smoke stick around until December. With the changing climate, it is difficult to predict. I honestly kind of thought we skated by mostly unharmed this summer until this week. It could be done in a week, or if another fire starts, it may be a bit longer. I don’t recall smoke in October so hopefully it’ll be done soon. \n\nDo you wear a mask? They help immensely with the smoke and the effects of it. I highly recommend. People were wearing masks in the summer even before Covid here.",
            "Most times they do a \"let burn\" practice and wait for the fire to burn itself out. It really depends on the location and size of the fire how long it will last. But most (bad) years we've had fires, it does last pretty much all summer into fall till it gets colder. And forests will never completely burn up because they are plants and regrow. The new growth won't be as flammable and will grow lush. Rinse and repeat.",
            "Wood stove smoke  may also be a concern during the winter when inversions set in. Like mentioned above, a good quality mask may be a good investment.",
            "I've lived in other places, but they also dealt with wildfire smoke, and I wouldn't say missoula is the worst I've seen. I understand it can be jarring if you don't know what's going on, though.\n\nThere will be forest fire smoke every year because there are forest fires every year. That's natural, although obviously it has been exasperated by climate change. It doesn't help that smoke tends to get stuck in the valley, and we occasionally get smoke from as far away as oregon or even california. Last year was an unusually mild winter which made local wildfires much worse, which definitely isn't helping. \n\nBUT, it isn't constantly bad. Even if we have a warm fall (which I'm hoping we won't), there will be periods of relief where the smoke is much less thick or not here at all. I hope that's comforting \n\nI think your best bet is to figure out strategies that help you cope. Obviously staying indoors helps, but I get that's can make you go nuts. If you still have any masks from the pandemic lying around, those can actually help a lot. And while you can't be outside for long periods of time, maybe try looking at the many groups that meet at the library. Go to a movie (The Roxy is cheap). And because the valley traps so much smoke, there are times when the surrounding area has better air quality, so a drive out of town can help. \n\nBest of luck! This is a fact of life in the mountain west, but I get it can really hard to adjust to and people aren't always understanding.",
            "You'll be dealing with it all your life if you stay here..... Is it bad this year? Yeah, but it's gonna be shitty every summer no matter what. You can always count on fire season. If we don't get a lot of rain or run off, everything's dry and we have a bad fire season. If we have a ton of moisture and runoff, everything grows great then drys out and we have a worse fire season.... Regardless, no matter what, we always get shit on with smoke....",
            "Thanks everyone. I needed a dose of reality.",
            "If you have the means and the time, a quick 45 minute drive out of town can get you out of the smoke for a few hours and you can see clean skies and mountains",
            "Buy a good electric air purifier and if you can stand it, wear KN95 masks just like covid times. Good luck",
            "Cool weather and rain in the forecast this week.  If there’s some winds with it too it’ll really help with the air quality.  The smoke is pretty bad right now, some summers we have it for moths, others it’s just a few weeks.  This year we’ve had *relatively* good save the last few weeks",
            "Time to become a local and get out there, go for a run, ride your bike, hike the mountains. What? Do you want to live forever? ",
            "Exactly. 30 years from now, the forest that burned this year will be maturing and ready to burn again.",
            "It's also one of the worst cities of its size in the country for crime. \n\n\nMiserable winters, smokey summers, and a good chance of being robbed. WTF do so many people want to move here ?",
            "Yea, get a good reusable n95, and buy air filters for your house ",
            "Thank you, I like your suggestions for things to do. Being stuck in a house with one’s parents is a challenge. I’m going to go to the library today.",
            "Um, I’d call this a good year for smoke. It’s been bad for only a few days in a row, clears up, and has rarely been worse than moderate \n\nA bad year is 2-3 weeks of orange sun and literally no horizon.",
            "Great public transportation and bike infrastructure. World class outdoor recreation minutes from your door. Amazing college, vibrant arts and music scene. No traffic jams to speak of compared to commuting in a major city area. If you can work remotely, skipping town during the worst of fire season is an option. I’ve only had very minor property crime experience; feel safe walking anywhere.",
            "Been here my whole life, I have never felt unsafe. I don't have a source on crime statistics but I'm calling bullshit here unless you can provide it.",
            "Best of luck! Moving here can be a big adjustment. I know a lot of people aren't really that understanding about it, but it's possible to adapt.",
            "https://www.neighborhoodscout.com/mt/missoula/crime\n\n\n\" With a crime rate of 41 per one thousand residents, Missoula has one of the highest crime rates in America compared to all communities of all sizes - from the smallest towns to the very largest cities. One's chance of becoming a victim of either violent or property crime here is one in 24. Within Montana, more than 95% of the communities have a lower crime rate than Missoula. \" "
        ]
    },
    {
        "title": "Rattlesnake Fire? ",
        "score": 1,
        "date": "09-03-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1f88wv1/rattlesnake_fire/",
        "num_comments": 1,
        "comments": [
            "Get a scanner"
        ],
        "replies": []
    },
    {
        "title": "Sharrott Creek / Stevi Fire Video Update. Winds predicted this afternoon, possible rain tonight.",
        "score": 20,
        "date": "08-27-2024",
        "url": "https://www.facebook.com/DiscoverBitterrootNF/videos/1197801504833310/?mibextid=rS40aB7S9Ucbxw6v",
        "num_comments": 2,
        "comments": [
            "Thank you for the update!"
        ],
        "replies": [
            "Everyone do a rain dance and step on as many daddy long legs as you can!"
        ]
    },
    {
        "title": "St. Mary's fire is blowing up",
        "score": 123,
        "date": "08-24-2024",
        "url": "https://i.redd.it/533zqp3luikd1.jpeg",
        "num_comments": 13,
        "comments": [
            "I can see it from my house in Corvallis. That windstorm today really messed up shit from Darby to Victor. I didn't see much damage past victor."
        ],
        "replies": [
            "My in-laws live up Kootenai and are under pre-evac orders. Please talk to your loved ones that are close to this and make sure you are ready to help.",
            "St. Mary’s, or is that the Sharrott Creek Fire?",
            "Just heard one of the helicopters flying super low over town. Like shaking the windows of my house low.",
            "Sharrott Creek Fire @ ~3 miles west of Stevensville - #SharrottCreekFire https://share.watchduty.org/i/31997",
            "I pray all of you and your families are safe. Are these fires normal for Montana ????",
            "I got a ton of wind in Lolo as well, ɓut i have family at the base of this mountain. The wind made it explode right after it ignited. It's moving super fast.",
            "For evac updates Sharrott Creek Fire @ ~3 miles west of Stevensville - #SharrottCreekFire https://share.watchduty.org/i/31997",
            "Same thing I believe. It was renamed I think.",
            "Yes",
            "yes, every year since i’ve been born has had really bad fires. this close to town is pretty crazy tho.",
            "The wind was really wierd down the valley.  It was like small super bursts of wind in random areas.  We lost a shed, but the shed 20 feet away was fine.  Then across the street 4 trees down and a little past that another person lost a shed.  Like mini tornadoe stuff.  It was wild.",
            "Well I hope everything is good in the long run I did not know Montana had fires crazy that close"
        ]
    },
    {
        "title": "The hills on fire, Boo!",
        "score": 124,
        "date": "08-24-2024",
        "url": "https://v.redd.it/q7zsw659mikd1",
        "num_comments": 11,
        "comments": [
            "Evacuations are happening! Sharrott Creek Fire @ ~3 miles west of Stevensville - #SharrottCreekFire https://share.watchduty.org/i/31997"
        ],
        "replies": [
            "9pm acreage updated to 1600 acres",
            "I think we need an updated video since it’s blowing up even more 😬",
            "whoa! where at?",
            "that’s crazy that your phone can zoom that well",
            "Fuuuuck. Pictures of fires are scary enough, idk why but this video is terrifying.",
            "Yep, starting to make its way down the front of the mountain. \n\n[https://i.imgur.com/r8bDgog.jpeg](https://i.imgur.com/r8bDgog.jpeg)",
            "St. Mary peak by Stevi",
            "It can't, that's my $1000 camera 😆",
            "Rightfully so, those flames are 100s of feet tall.",
            "haha that explains it 😭"
        ]
    },
    {
        "title": "St Mary’s fire timelapse",
        "score": 80,
        "date": "08-24-2024",
        "url": "https://v.redd.it/jiw0zq48jikd1",
        "num_comments": 1,
        "comments": [
            "Thank you for posting that!"
        ],
        "replies": []
    },
    {
        "title": "Stevensville Fire",
        "score": 11,
        "date": "08-24-2024",
        "url": "https://www.reddit.com/gallery/1ezrsgo",
        "num_comments": 6,
        "comments": [
            "Not that it’s the primary concern, but the smoke made its way up to Missoula pretty quickly."
        ],
        "replies": [
            "Sharrott fire is at 1600 acres last I checked.",
            "Sharrott Creek Fire @ ~3 miles west of Stevensville - #SharrottCreekFire https://share.watchduty.org/i/31997",
            "300+ acres in less than an hour.  Started by two simultaneous bolts of lightning, fed rapidly by high winds.  Just saw some drops of rain so hopefully can get some water coming down.\n\nDoubtful able to get air support on it yet.",
            "Hopefully, im worried because my dad lives at the base of st marys. And i live 4 hours away.",
            "I'd suggest getting in touch with him.  Ravalli County sheriff's have already started going door to door for evacuation warnings.  There's community members on Facebook groups jumping in to offer assistance for animals or RV hookups"
        ]
    },
    {
        "title": "Stevi fire",
        "score": 171,
        "date": "08-23-2024",
        "url": "https://i.redd.it/wt8ldwiqohkd1.jpeg",
        "num_comments": 22,
        "comments": [
            "If only the sprinkler was just a bit closer."
        ],
        "replies": [
            "Ouch that grew fast.",
            "That's pretty ugly for being so new.",
            "Hope no one was hiking up there. It started and moved crazy fast.",
            "Evac warning now issued: https://nbcmontana.com/weather/wildfires/wildfire-reported-on-st-marys-peak#",
            "Thanks for the pic!",
            "That's a fantastic photo.   Sell it to the paper ",
            "Not looking good",
            "[deleted]",
            "I'm not a wildland firefighter but my daughter is. This.is not good. Anyone close to this should pack their car now with meds, documents, and pets and anything precious. Be ready.",
            "That’s a popular trail.  Lucky, it’s short and you can get back to your vehicle in a couple of hours at most, but… the trailhead is an hour by forest service road to the nearest pavement.  On summer evenings there are always late hikers driving down, in the dark.  It takes forever and crisscrosses all over the mountain face.\n\nDoing that with a fire blowing up?  I hope everyone got down ok.",
            "When they say get ready it's not precautionary- it's a time sensitive warning. Get ready and alert your neighbors who might not be aware...and BUG OUT!!",
            "So dumb. And why don’t they bring out space heater everywhere in winter? Then it wouldn’t be so cold.",
            "Should have asked him if he was with the environmental wacko who won't let us cut them to reduce the fuel.",
            "It lets the professionals focus on getting the fire out instead of getting the people out!",
            "[deleted]",
            "or a really big umbrella when storms",
            "Yeah and why do they keep putting those deer crossing signs in the middle of the highway!? Terrible place for deer to cross!",
            "I do but currently in use. NE clams 10pm til power might be back on",
            "See we are now thinking solutions instead of problems. That can plug into the outlets we should install everywhere",
            "100% agree. Some irresponsible local deer nearly killed me and my family on the highway! If I wasn’t going 90mph already it would have hit me! The park rangers really need to kennel their deer pets at night. It’s cool letting them roam during the day for photo ops and selfies",
            "Lifehack: smear your babies face with jam and the bears can lick it off for a cute photo!",
            "Adorbs!"
        ]
    },
    {
        "title": "ah shit here comes the smoke again",
        "score": 7,
        "date": "08-02-2024",
        "url": "https://www.star.nesdis.noaa.gov/goes/wfo_band.php?wfo=mso&band=GEOCOLOR&length=24&dim=0",
        "num_comments": 5,
        "comments": [
            "It's been a reasonably good year for us so far. I can't complain. I've mostly been in Montana since I was born in 81, so my baselines have shifted a LOT. Now I expect unbreathable air from early July until late September, while it used to just be rare to experience."
        ],
        "replies": [
            "Oh? Did that one kid finally find someone to take his AMC giftcard for 2 packs of cigarettes?",
            "It is getting thicker than a snicker all over the place. Time to get those air purifiers on overdrive.",
            "It’s called summer.",
            "According to MissoulaMugs around 11:00 am Wednesday July 31st, yes, but it was a sting-op I guess 😂"
        ]
    },
    {
        "title": "Fire Restrictions",
        "score": 5,
        "date": "08-01-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1ehtspq/fire_restrictions/",
        "num_comments": 5,
        "comments": [
            "No.\n\nThe restriction is on internal combustion engines."
        ],
        "replies": [
            "Me at 2am",
            "How the fuck am I going to start a fire mowing my green, watered lawn?   I can see if someone was knocking down weeds in a dry lot, but a blanket ban is stupid",
            "Thanks!",
            "You won’t. But a lot of people don’t have much common sense these days. Without an all our ban, knuckleheads will be out there mowing their vacant lots and unwatered lawns."
        ]
    },
    {
        "title": "Rattlesnake Fire Crews",
        "score": 4,
        "date": "07-26-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1ecb7bw/rattlesnake_fire_crews/",
        "num_comments": 3,
        "comments": [
            "[Fraser Fire](https://share.watchduty.org/i/28003)"
        ],
        "replies": [
            "The Watch Duty app is showing a new fire up Rattlesnake",
            "Helicopters are pulling water out of the river downstream from Sha'Ron\n\n  \nCarl"
        ]
    },
    {
        "title": "Power Outage/Fire at Old Chicago last night",
        "score": 2,
        "date": "07-25-2024",
        "url": "https://v.redd.it/rgp6el3y5red1",
        "num_comments": 1,
        "comments": [
            "Fire at the restaurant or across the street? Hope everyone is okay!"
        ],
        "replies": []
    },
    {
        "title": "Any new fire starts around Missoula?",
        "score": 4,
        "date": "07-25-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1ec5adb/any_new_fire_starts_around_missoula/",
        "num_comments": 3,
        "comments": [
            "There was fire at the town pump in Milltown but it got put out pretty quickly last night"
        ],
        "replies": [
            "Nothing reported so far 🤞🏼",
            "Downloaded the Watch Duty app a couple days ago due to a post on this sub and it's pretty good: \n\nhttps://play.google.com/store/apps/details?id=org.watchduty.app"
        ]
    },
    {
        "title": "REMINDER TO REPORT ANY SIGHTING OF NEW FIRES IMMEDIATELY ",
        "score": 119,
        "date": "07-25-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1ebllds/reminder_to_report_any_sighting_of_new_fires/",
        "num_comments": 5,
        "comments": [
            "Yes, please. Even if you only think it’s smoke, call it in."
        ],
        "replies": [
            "No I think I’ll wait a while. \n\nWhat a dumb fucking post",
            "you sound like you’d be a lot of fun at parties",
            "😂 but also, with how many non-natives live here now, not that dumb of a post.."
        ]
    },
    {
        "title": "New fire just west of Stevensville from tonight's storm",
        "score": 74,
        "date": "07-25-2024",
        "url": "https://www.reddit.com/gallery/1ebl481",
        "num_comments": 7,
        "comments": [
            "Good eye my friend. I’m taking you hunting with me. That one may be worth reporting it’s so new."
        ],
        "replies": [
            "Looks like it's north of brooks creek under the bass peak ridge for what it's worth. It has been reported\n\nUpdate: looks like fire engines are at the base of the mountain at the bass creek trailhead",
            "😢",
            "Uncle is near there, y'all stay safe out there.",
            "DEFINITELY worth reporting. More wind may be coming",
            "Oh man I can see that from where I live.  It’s glowing orange right now and there doesn’t look like any lights or activity around it.  That’s pretty inaccessible and steep terrain.  I can’t tell in the dark but I think that area might have burned in the recent years too if im thinking of the right ridge.",
            "It burnt back in '06 iirc. This slope wasn't affected by the lolo peak fire for sure"
        ]
    },
    {
        "title": "Due to the emerging Butler Creek fire, an EVACUATION ORDER has been issued for the Indreland and Buffalo Speedway zone and the West Butler Lavelle Creek Zone. LEAVE THE AREA IMMEDIATELY! ",
        "score": 85,
        "date": "07-22-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1e9dp47/due_to_the_emerging_butler_creek_fire_an/",
        "num_comments": 4,
        "comments": [
            "How is the fire this morning?"
        ],
        "replies": [
            "307 acres, 15% contained"
        ]
    },
    {
        "title": "Sorry for the picture quality but looks like Evaro area is on fire this morning ",
        "score": 77,
        "date": "07-22-2024",
        "url": "https://i.redd.it/amcifihp42ed1.jpeg",
        "num_comments": 7,
        "comments": [
            "Looks to be up Butler Creek, first reported around 1:20am Monday."
        ],
        "replies": [
            "https://www.reddit.com/r/missoula/s/xGuRzVVxnE\n\nButler Creek is under an Evacuation Order.",
            "Kinda looks like a foggy concert.",
            "This is only 5 miles from me",
            "Thanks, it was super early and I couldn’t see exactly what drainage was on fire.  I can’t seem to be able to edit the title",
            "Sorry, some of the photos on the Facebook are pretty terrifying",
            "No worries. Reddit does not allow edits to post titles."
        ]
    },
    {
        "title": "Fire, reported explosions prompt Missoula officials to close Lions Park",
        "score": 27,
        "date": "07-18-2024",
        "url": "https://archive.ph/5repi",
        "num_comments": 34,
        "comments": [
            "I let my kids put a tent up in the backyard and the city contacted me multiple times and then these folks are completely fine camping in a park… this is delusional"
        ],
        "replies": [
            "Good thing they're not allowed to camp in public parks or within 100' of the river anymore...",
            "Just another week, when will this stop?",
            "So glad we were fortunate enough to move away when we did. I don’t know if Reddit is making Missoula seem worse off than it is or if it really has gone as downhill as the recent posts make it out to be. Really sad. Missoula used to be such a beautiful, peaceful , safe place to live.",
            " Many people in the neighborhood have said they'll start calling 911 about this place starting on July 25. \n\nI get it. It's right next to a Foster Home. Someone needs to stand up for those kids.",
            "“Property damage was minimal, he said, other than some fire damage to a tree.”\n\nOh no some burnt bark whatever will we do 😢😭",
            "Get a grip, you really think that because someone like yourself or myself has the opportunity to make extra money in today's shit market by renting a  room out for extra income it's all air bnb ??? The facthat you can read an article 3 days a week in the local news about how city officials are meeting to address  the cost of housing here, all the while they are building new track homes with the modest median starting price of 750K hello reality let's find someone to blame. I  don't make 200 k a year but I don't blame the guy in the next tax bracket for try to keep his head above water. Pull your head out of your rectum look at what's going on across the nation and hold your local, state, and federal representatives accountable for doing a shit job, and yes make sure they get their pay raises, make sure the local state commissions approve rate hikes for your utilities while you make the same and get no more, but most of all talk to your neighbors, form groups, speak out and vote, and if they aren't doing a good job and your taking it from behind and they are not even pulling your hair, demand change. I done wining my 2 cents worth at least that what it used to be worth.",
            "absolutely fucking delusional. it’s getting so bad 😩",
            "The ordinance doesn't go live until July 25th and it's 50 feet of the river and parks are not banned just some of them.  You really need to educate yourself about this if you are going to complain.",
            "thats the secret, it wont.   \npeople who are working cant afford to live here, homelessness will continue throughout the collapse of the United States failing experiment.",
            "Imo reddit is 100 percent worse than the real thing. This sub is one of the most negative and ridiculous in my feed. Not that there isn't a homelessness issue, but day to day life for most of us goes on and is nothing like this.",
            "It’s a mix of both. There’s a lot of gut wrenching stuff going on.  I used to wish we had a bit more growth because it felt kinda boring sometimes but … not like this.  \n\nBut at the same time there’s regular day to day missoula normalcy still happening too.  Hiking is still good, it’s crowded sometimes but really not all the time.  The farmers market is still adorable, even though it’s crowded too, Etc.  but yeah for long time residents it does feel overwhelming at times to see how much is getting bought up, flipped, and ruined.  💔  I keep hoping it’s some kind of phase and that it will settle back into its old self again some day.  Probably won’t but I wish",
            "Where did you end up going. We are looking to move to Missoula, but having doubts.",
            "Sad but true... the Airbnb trend has created a sort of plague thar forces people out of their homes. It's better monetarily for property owners to do Airbnbs than rentals and too expensive for people to rent or own homes if they're below (or even AT) the median income. I make nearly $200k per year and most of it goes to rent / food for my family of 5 / paying off student loans.",
            "that’s dark",
            "These aren't dispossessed renters, no matter how many times you insist that they are. It's opiods. That's it.",
            "We moved about an hour outside of Missoula to raise our newborn son. Up the bitterroot is beautiful, west has some great spots, really any direction has some good options. We just did not trust being in the city anymore and wanted somewhere a little more predictable. Still love Missoula just needed some quiet.",
            "1000 air BNB here in Missoula 800+ people unhoused.  You barely qualify for a home loan here also is my guess also",
            "Mind me asking what you do that makes 200k in Missoula Mt? Data or CS?",
            "Air b and bs. Haven't creates the homeless issue. People have decided they want ti be here no matter the cost. Putting thier families lives in the drains. There are plenty of other places to relocate in this country that are much more affordable. But, pride and bullheadness can get in the way of reason sometimes. Others have moved away and are hopefully to be able to move back in the future. Sure a large % of the homeless here are addicts and don't want to improve. There are plenty of resources available if they choose to seek then out.",
            "dark, but happening in real time.",
            "Your comment tells me you have very little actual knowledge about the homeless crisis which is separate from the drug epidemic.",
            "So you staying the vicinity, very cool. It’s good to know you didn’t leave the state completely. We used to live elsewhere in MT, left to the northeast for family reasons and want to come back.",
            "I'm a software engineer.",
            "They haven't created the homeless problem but they've created this plague of new homeless. The original homelessness problem began in the 1970s when psychologists started treating mental illness with pharmaceuticals and declared the mentally unhealthy to be \"cured\"! Asylums started letting people with severe schizophrenia and bipolar disorder out in droves... and wouldn't you know it... they stopped using or being able to afford their medication. Suddenly there's a huge influx of people who cannot deal with societal norms being pushed into the street. The opiate epidemic is another major cause, again started by poorly educated or negligent medicap professionals. This latest plague is due to property owners however. Driving the poor out because they want higher rent or using them as Airbnbs.",
            "A lot of people can't afford to relocate.  I was fortunate to be able to, but it was definitely expensive.  Especially because the affordable parts of the country are generally the Midwest and South.  Renting a Uhaul for those kind of distances is in the $5k range, or was a couple years ago.  Not to mention securing work and housing across the country.  It was totally worth it for me, but not everybody can do that.  Especially not when already living hand to mouth.\n\nSince leaving, I have recognized I will probably never be able to afford to move back and live in Missoula.  It sucks, because I miss my family and the land.  But I also love where I live now, and being able to get by on much less.",
            "Ikr",
            "You’re wrong. There is very little separation between the homeless crisis and the drug epidemic. Things aren’t true just because they must be.",
            "Nope we still love the area and access to everything just the city itself was starting to make us a little uncomfortable. Maybe it’s new parent paranoia , but we just feel soooo much better with some distance.",
            "Only way would be to get rid of everything and move on the cheap.",
            "The homeless crisis is far more complex than just drugs sorry.  Also way more housed people are using drugs you just can't see them because they have the luxury of a house to do them in.",
            "Yep.  Even then you still have to figure out how to replace everything.  Some of which you can do pretty cheap, but soft goods are tricky in areas with fleas and bedbugs.",
            "No need to apologize, it is a complex issue!",
            "For sure. Gotta pick up some discount beds or use futons for a while until you can pick up a proper bed. I slept on used beds for... probably longer than I'd like to admit. I always got them from friends who I knew were clean tho."
        ]
    },
    {
        "title": "Update on Deer Creek fire? ",
        "score": 4,
        "date": "07-18-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1e5xo9o/update_on_deer_creek_fire/",
        "num_comments": 8,
        "comments": [
            "You can’t extinguish the fire that is east Missoula. It burns with furious passion."
        ],
        "replies": [
            "Watch duty says it’s 100% contained.",
            "It looked to be out when I drove by a little bit ago.",
            "I believe it’s been contained. But until official release, that’s not confirmed.\n\nCheck this site periodically:\n\nhttps://experience.arcgis.com/experience/59072baa167c4687a7349c05f5072cf9",
            "100% contained",
            "Miller creek fire ?",
            "Just discovered the Watch Duty app and it’s a great resource! It is the most up-to-date source for fire info. Especially helpful for knowing about new starts.",
            "Whoosh!"
        ]
    },
    {
        "title": "Crews on scene of wildfire in East Missoula",
        "score": 23,
        "date": "07-17-2024",
        "url": "https://www.kpax.com/news/firewatch/crews-on-scene-of-wildfire-in-east-missoula",
        "num_comments": 11,
        "comments": [
            "Fire’s out. Pumper and two brush trucks dousing hot spots. Grass fire. \nFire was across the road from the range in Milltown State Park."
        ],
        "replies": [
            "Thank you very much for the information.",
            "I'm beginning to wonder if maintaining the brush along the tracks would be a better cost to the county.  Any thoughts?",
            "I don’t understand why no fire restrictions are in place. It’s hot as hell this week with zero humidity. No one needs a fire right now when it is 60* at night. Insane! https://nbcmontana.com/news/local/fire-danger-raised-to-extreme-in-missoula-co#",
            "There was a post earlier, I can’t remember what thread..someone in a white car was throwing firecrackers out and starting grass fire up there.",
            "Came here to look for this. Thank you!",
            "Or requiring more stringent monitoring of trains and their braking systems and bearing upkeep...  If only some previous president hadn't completely gutted the regulations that Obama had put in place 🤷‍♂️",
            "It was probably caused by a train.",
            "Notice it said \"fire is in the area of the shooting range\"? Pretty sure they are indicating that it started from hot lead, from a bullet or casing. Just like (speculation) the Miller Peak fire  supposedly started as it was out by a makeshift firing range. \n\nWhile there should be a ban on fires, there should also be a ban on outdoor firing ranges until the area gets plenty of precipitation",
            "It was the train from what I heard",
            "This picture is obviously between Deer Creek Road and the river. The shooting range is on the other side of the road. There are power lines there though."
        ]
    },
    {
        "title": "When smoke rolls in: Emergency planning and evacuations",
        "score": 22,
        "date": "07-16-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1e51xif/when_smoke_rolls_in_emergency_planning_and/",
        "num_comments": 1,
        "comments": [
            "Hello u/Missoulacounty, I'm so glad the AQI kitty is back!"
        ],
        "replies": []
    },
    {
        "title": "Downtown Lions Park on fire. Again.",
        "score": 18,
        "date": "07-16-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1e4zyz2/downtown_lions_park_on_fire_again/",
        "num_comments": 18,
        "comments": [
            "This is getting so stupid… we need bigger fines for people starting fires, it seems like it’s a weekly event that Jacobs island gets set on fire now"
        ],
        "replies": [
            "That straight just sucks. Let me guess Jacob's island dog park is next again today? It would be par for the course.",
            "Two weeks ago… the island under the California Street Footbridge, behind Northside Lions Park, was set on fire two days in a row.\n\nAnd not “little” fires either… 3 engine runs on both accounts… they didn’t even send cops to deal with the people who had started non-legal fires within city limits… FD just put them out and moved on.",
            "What the hell is downtown Lions Park?",
            "Any of them.",
            ">it seems like it’s a weekly event that Jacobs island gets set on fire now\n\nThe city should just own that and have the fire planned. Friday Night Fires they could call it. People could sell beer and hotdogs, maybe display some art....",
            "Teenagers lit Jacob’s Island fire but I have yet to hear if anyone was charged.",
            "Which fire? The first one or the second?",
            "The one off Broadway, next to the river, by western cider",
            "I’d go to that in a heartbeat! I feel like if someone set up a firework show with a farmers market type vibe, it would make ALOT of money",
            "I remember.  Just seems like we are having lots of fire's in city limits at the parks this year along the river.",
            "I’m only aware of the one that happened on July 4. Was there another before that?",
            "Does the homeless population have something to do with this?",
            "There were 2 just a week or so apart that I saw posted about on here. I thought the first was said to be teens which was before the 4th.",
            "The one on the fourth was started by a homeless guy. I was there with my dogs that evening watching him collect driftwood for a fire. Not 3 hours after watching him (I left around 8pm) the post about the fire was made here on reddit. The one before that was the one started by some random teens.",
            "It wouldn't matter if it was the homeless population or not the city won't do anything about it.",
            "Oh yeah I can’t even keep up anymore.  https://www.reddit.com/r/missoula/s/LeZvEmbDJm",
            "Seriously there's been a lot of fires similar lately..."
        ]
    },
    {
        "title": "Smoke from Miller Peak Fire over Mt. Sentinel, 7/15/24, 4pm",
        "score": 8,
        "date": "07-16-2024",
        "url": "https://youtu.be/yUPzIWPIuNQ",
        "num_comments": 4,
        "comments": [
            "The latest update from inciweb.\n\"Working in cooperation with community officials and local agencies, fire managers have identified and prioritized critical values at risk, focusing available resources and current efforts on the protection of the homes and structures in the Miller Creek drainage, the I-90 corridor, critical energy infrastructure/powerlines, and the communications towers on Miller Peak.\"\n\nI-90 Corridor, let that sink in."
        ],
        "replies": [
            "Smells like it all moved down into the valley this morning :(",
            "coming for a neighborhood near you",
            "Winds should pick up a bit out of the west this afternoon and blow it out. Looks like tomorrow the wind is shifting to SE though so tomorrow will be bad."
        ]
    },
    {
        "title": "Miller Peak fire description update",
        "score": 9,
        "date": "07-15-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1e4a6nn/miller_peak_fire_description_update/",
        "num_comments": 16,
        "comments": [
            "Good info on \"Inciweb.\"  Search on that, then use map, state, or name to get to fire info. Has everything from maps, announcements, public meeting plans, photos, etc. Usually up to date within a few hours."
        ],
        "replies": [
            "I believe the original warning zone was an error.",
            "When I saw where the blaze was on a map I knew it didn’t match the addresses they were giving. I’m down near the Upper/Lower Miller Creek split, and it even had me nervous.",
            "1500+ acres at this point. Please be safe out there, be careful with fire, and avoid the area. The Forest Service has road guards in place keeping people from driving up there to 'take a look.'",
            "Here is the FTP website where they post daily maps (conditions dependant) of the fire perimeter, if you are curious.\n\nhttps://ftp.wildfire.gov/public/incident_specific_data/n_rockies/2024_fires/2024_MillerPeak/GIS/",
            "I’m using the app called Watch Duty and it sends notifications to my phone with updates about the fire",
            "https://play.google.com/store/apps/details?id=org.watchduty.app\n\nWatch Duty is a useful app to keep up to date on fire activity.",
            "Thank you!!",
            "The original zone was minutes from my home, very stressful.",
            "Same location & same nerves.",
            "Glad to hear they are keeping people out!",
            "Where are you getting 1500 acres?  This evenings update is reporting 800, up 300 from 500 yesterday.",
            "Hero. Thanks!",
            "Mine too. Very unnerving.",
            "Two differing websites w/ two differing numbers. \n\n[https://www.mtfireinfo.org/pages/current-fire-info](https://www.mtfireinfo.org/pages/current-fire-info)\n\n  \nand,\n\n  \n[https://inciweb.wildfire.gov/incident-publication/mtlnf-miller-peak-fire/updated-evacuation-warning-upper-miller-creek-road-07-15-2024](https://inciweb.wildfire.gov/incident-publication/mtlnf-miller-peak-fire/updated-evacuation-warning-upper-miller-creek-road-07-15-2024)\n\n  \nand a 3rd one,\n\n  \n[https://mtdnrc.maps.arcgis.com/apps/webappviewer/index.html?id=6bea18851bec440d9260cb0d28f53281](https://mtdnrc.maps.arcgis.com/apps/webappviewer/index.html?id=6bea18851bec440d9260cb0d28f53281)",
            "USDA contact within one of the organizations present on the fire."
        ]
    },
    {
        "title": "UPDATED: Miller Peak fire south of Missoula up to 500 acres Sunday evening ",
        "score": 7,
        "date": "07-15-2024",
        "url": "https://archive.ph/yOhFN",
        "num_comments": 3,
        "comments": [
            "https://play.google.com/store/apps/details?id=org.watchduty.app\n\nWatch Duty is a useful app to keep up to date on fire activity."
        ],
        "replies": [
            "[deleted]",
            "Watch duty is a good app been using it since last year.",
            "Wym, \"very sus?\""
        ]
    },
    {
        "title": "Miller Peak Fire Evacuation Warning ",
        "score": 60,
        "date": "07-15-2024",
        "url": "https://i.redd.it/six5mqsqzlcd1.jpeg",
        "num_comments": 20,
        "comments": [
            "I saw they are sharing the advice to sign up for [Smart911](https://www.smart911.com/)   So I am just sharing that link here in case people don’t read the whole article.  \n\nIt’s so you can get alerts to keep you safe if you are in the area but since fire season is looking gnarly already seems a good idea for everyone"
        ],
        "replies": [
            "7018 Upper Miller Creek is like a 3 min drive from Walmart 😬\n\nIf wildfire reaches a Walmart, civilization is lost",
            "When the wind died down, and there was 2 hours of daylight, Neptune stopped tanker runs. Why?",
            "The evac zone is Linda Vista @ Miller Creek 😮",
            "saw people on Facebook saying they lived in the evacuation area but weren't getting notifications. So not sure if it is a sure \\*fire\\* way to get info",
            "We can afford to lose one Walmart, but if we lose the other and Costco..... it's gonna be a bloodbath!",
            "The pilots are limited to 8 hours of flight time a day and those tankers have been flying hard the last several days with all the new starts. And those planes are national shared resources, so they can be pulled for other missions. Can’t say why for sure, but I doubt it was just for the sport of watching trees burn.",
            "The amount of air resources crashes this fire season already is crazy. They are humans they need breaks too. They can’t fly 24/7. Plus they need refuel time, and know more about weather patterns and safety than you do. If they weren’t flying there’s a reason why.",
            "Helicopters will continue to work on the fire today, but the air tankers will not be working as they were not effective in the fuel type yesterday. Resources on scene include 8 engines, 3 helicopters, multiple crews, and miscellaneous overhead. Additional resources including crews and an Incident Management Team have been ordered. The cause of the fire is under investigation.",
            "Crew duty day limits. We were spread so thin, we had to call in additional support from Helena, Billings, and Boise to help.",
            "Don't wanna work yourself out of a job, now...",
            "The puns on these posts are sizzling HOT!  Lol \n\nOk that’s good to know.  I am also using that app , Watch Duty .  Maybe it’s better?",
            "Thankfully it's an unburnable urban wasteland between the two Walmarts",
            "Legit, I figured it was something like that. Four planes and the overwatch came in within 10 minutes at most.",
            "I'm sure you could volunteer to be on the ground team.",
            "Smart",
            "Yea I downloaded that too and seems to give good info",
            "Lahanina ring a bell?",
            "Why would I volunteer, I'm already paying them. Maybe once some of you have been around long enough to realize that there are bad apples in every bunch, but usually it's someone whooping some civilians ass on the ground to keep it going, not the pilots. My bad."
        ]
    },
    {
        "title": "2024 Missoula Fire Season Has Begun!",
        "score": 51,
        "date": "07-15-2024",
        "url": "https://i.redd.it/0rktq7hjvkcd1.jpeg",
        "num_comments": 2,
        "comments": [
            "[removed]"
        ],
        "replies": [
            "Stfu"
        ]
    },
    {
        "title": "Fire",
        "score": 94,
        "date": "07-14-2024",
        "url": "https://i.redd.it/ueml8yvmhkcd1.jpeg",
        "num_comments": 35,
        "comments": [
            "Damn that looks heavy. Been hearing helicopters."
        ],
        "replies": [
            "It’s called the Miller Peak fire.",
            "Just as a general PSA, it's a good idea for everyone to sign up for Smart 911. That's what Missoula County uses for sending out emergency alerts. [https://www.missoulacounty.us/government/public-safety/office-of-emergency-management/smart911](https://www.missoulacounty.us/government/public-safety/office-of-emergency-management/smart911)",
            "This is what you get when you mix UTVs , cigarettes,  and twisted tea's. Sprinkle in a dash of stupidity and voila!",
            "Miller peak fire!  Apparently its over 400 acres right now.",
            "Not in Pattee Canyon.",
            "Yeah it just keeps getting bigger. Saw the plume from brooks as well just now while running errands.",
            "And so it begins...",
            "[removed]",
            "This is in that creek up miller creek where people shoot guns (all the time) into a couple little makeshift shooting ranges made of tree stumps.\n\nObviously there was no lightning today and given that location and what goes on there, this is absolutely human caused.",
            "It's farther south. East of Florence.\n\nhttps://www.kpax.com/news/firewatch/wildfire-watch-smoke-seen-in-missoula-county",
            "https://arcg.is/i5mvi",
            "Was watching the firefighting on FlightRadar24. A few tankers from our airport, along with a 737 from Boise, an MD-87 from Billings, and a DC-10 from Helena came to help out.",
            "Don’t even fart folks.",
            "Great not pattee canyon! Ppl need to be careful right now!",
            "Change your post title or your new username shall be Miss Information.",
            "Uhhh everyone in South Hills doing OK, there is a thick cloud of smoke nearby with I think 100 acres on fire and high gusty winds right now. Am I overreacting in saying this is a little scary?",
            "And it begins",
            "And so it begins",
            "Miller Peak != Pattee Canyon",
            "I hate when they get names.",
            "[deleted]",
            "Came here to say something similar",
            "So the road is closed where it turns into dirt on miller creek road? Are they not letting any traffic past that point, and allowing only residents to evacuate?\n\nWondering as my family has a cabin up there and may go get some stuff out of it if possible. Do not want to get in the way of any emergency responders or anything so trying to get any information possible.",
            "My thoughts exactly. Wasn’t there a small fire there  last year or the year before?",
            "Post titles cannot be edited",
            "Don't panic, make a plan. If shit gets heavy, execute the plan",
            "The weather is definitely not good for fires right now.  Hot, dry, and windy with no relief in sight.  The Horse Gulch fire near Helena went from hundreds of acres to thousands in just a couple of days.",
            "It's pretty far away for now.",
            "It's 8 miles south of Missoula, so not nearby ATM.",
            "Makes it so much harder to cull",
            "Cause that's what real manly men drink, of course. Bud light is for fancy boys and they stopped selling Zima years ago.",
            "Just go, There will be someone at the road block that you can ask. \n\nStay safe.",
            "If winds shift poorly, 8 miles is not that far away.",
            "Such a terrible and funny joke hahaha"
        ]
    },
    {
        "title": "Fire East side of Carlton creek?!",
        "score": 22,
        "date": "07-14-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1e3fo7y/fire_east_side_of_carlton_creek/",
        "num_comments": 13,
        "comments": [
            "Just wanna shout out a Thank You to the fire fighters & smoke jumpers"
        ],
        "replies": [
            "It's in the Sapphires directly across from Carlton. [Snapped this shot on my down ](https://ibb.co/cX8KGRs). Unfortunately it is cresting the ridgeline where it is currently. I'm no fire scientologist but I'd imagine that will complicate things.",
            "From MCSO — Please avoid the Miller Creek area, near Plant Creek, for the safety of Firefighters and other first responders!!! If it is essential that you travel near the area, please be vigilant, yield to emergency traffic, and DO NOT STOP along the travel route.\n\nFirefighters from the Lolo National Forest and Montana DNRC are responding to a fire in the Plant Creek drainage near Miller Peak, approximately 8 miles southeast of Missoula.\n\nFor more information regarding the fire, please visit https://www.facebook.com/lolonationalforest.",
            "Looks like plant creek area. Just did the ride from Florence to Clinton last week, whole area was pretty green on the east side of the pass, but it’s also pretty steep terrain",
            "https://www.kpax.com/news/firewatch/wildfire-watch-smoke-seen-in-missoula-county",
            "https://www.mtfireinfo.org/pages/current-fire-info",
            "This wind isn't going to help containing it that's for sure.",
            "I just went outside and looked south from town and thought that it looked like smoke.",
            "Miller Peak Fire. Between Miller Peak & Yukon Saddle. Multiple airtankers, helicopters, air attack, and lead plane on it now.",
            "Ditto that!  They have been flying in nonstop for an hour or more.",
            "Fire Scientologist ☠️",
            "Lol I just used the the phrase \"I'm no fireologist\" at an appointment today!",
            "Just saw a plane fly by"
        ]
    },
    {
        "title": "Fire at Jacob’s island park ",
        "score": 145,
        "date": "07-05-2024",
        "url": "https://i.redd.it/i4vlkj35cnad1.jpeg",
        "num_comments": 64,
        "comments": [
            "That’s awful and makes me so sad holy crap"
        ],
        "replies": [
            "Didn’t this just happen a few weeks ago??",
            "Is this a [weekly](https://www.reddit.com/r/missoula/s/hPB4fUu87c) occurrence now? Ffs",
            "I was just on 90 and saw it. Come on people!",
            "This is why dogs must be leashed!!!",
            "Does anyone know if the teenagers who got caught lighting the fire week before last ever got charged/arrested?",
            "Straight up just sad.",
            "I went and checked this out… the fire only burned the pile of downed trees that were potentially hazardous anyways. Plus, it is all cleaned up so there will end up being more space for dogs to frolic about!👌🏼",
            "Ignorant as hell",
            "The bums at it again",
            "Hmmm I wonder why they say no fireworks in city limits!???? Oh yeah because of dumbasses like this….",
            "I was just there and everything was normal woke up today and saw this",
            "Well, the was a nice spot",
            "Anyone have news on how much was burned, if/when it will be reopened, etc?",
            "That’s crazy I was there all day must have started just after I left",
            "There’s a free app called Watch Duty, that lets you see all of the wildfires in the U.S. what time they were called in and the size.",
            "I assume it was a homeless camp? Can’t tell from\nThe photo",
            "Such a better place prior to being the bark park..; Traveller's would use the woods there, and the adjacent areas heavily.  We rarely had the problem of more permanent structures being sanctioned then.  Folks would meet up for drum circles in the evening and interactions were generally safe and interesting.  As a child you could mill around solo unsupervised; hunting crawdads, making small rock pools, and stick forts.  There was a large tree with a rope swing and it was a destination picnic location.  \nIt felt so unnecessary to change the use format to what it is today.  We never lacked in endless areas to take puppers to visit.",
            "It was a group of teenagers."
        ]
    },
    {
        "title": "Fire pits?",
        "score": 0,
        "date": "07-04-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1duzcjg/fire_pits/",
        "num_comments": 3,
        "comments": [
            "Patty canyon picnic area has them."
        ],
        "replies": [
            "In the county yes in the city no. Recreational fires are illegal in the city though there is little regard for city municipal codes in Missoula apparently.",
            "If you keep some hot dogs handy and claim you are cooking the firemen usually look the other way if it's a responsible fire. It's really not worth them enforcing unless fire danger is super high. Waste of their time"
        ]
    },
    {
        "title": "Fireworks PSA",
        "score": 53,
        "date": "06-28-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1dqqv7l/fireworks_psa/",
        "num_comments": 55,
        "comments": [
            "There are fireworks shows at the  Paddlehead stadium tonight and tomorrow night. City folks be prepared. ✌🏻"
        ],
        "replies": [
            "PSA.  Lighting bottle rockets in your hand while blasted on PBR is peak American...  Don't let these blow hards tell you different.",
            "oooooo another good reminder would be for pet owners to keep their pets indoors when it becomes night time! we don’t want our fur babies running off to god knows where from the noises!",
            "Also you vet should have the proper meds to help with your furies. They are usually closed for the 4th but  can have meds readily available. This happens every year . Stay prepared! Happy independence day!",
            "[removed]",
            "My dogs hate them, but it only happens a handful of times a year.\n\nGo light off some fireworks and enjoy yourselves. Happy 4th!",
            "Also, many people have ptsd that gets set off by said fireworks. Including veterans. Likely they are a large part of thst population. I'm not really happy when people scare my cat, but I get just as upset remembering having to sit with an elderly gentleman who was hiding in an ally after 5he 4th of July brought him back to Vietnam a decade back. Havnt lit one since",
            "I fully expect my neighbors as usual will be using the local city public park basketball courts again this year to light their arsenal of fireworks as they do every year and that police will do basically nothing about it as usual.",
            "Does AR-15 fire do the same?  Cuz I live down the bitterroot and there’s plenty of that every 7/4",
            "Fuck fireworks. Can’t we just get wasted on or near water and leave it at that? I don’t want to comfort my dogs when they should be comforting me after I demolish 47 hot dogs and 72 beers.",
            "They’re also gonna wake up my baby 😭 not looking forward to next week lol",
            "My neighbors dogs wake me up and keep me up when I try to go to bed every night. I think they can deal for a week of fireworks.",
            "It's biden's fault that fireworks are so expensive!",
            "Even if they are a flat surface, they can and DO tip over if they are multishot! We learned that the hard way when my first son was 1 and we had a 10 shot and we ended up ducking and covering while shots were exploding past our heads and under vehicles! My wife had my son attached to her front and she nearly got hit! Everything in movies prepared me for vehicles to explode in flames after the shots went off under them!",
            "Are you sure you are a resident of Montana, and as an extension,  a citizen of this country?  You know, the U S of A???",
            "This is a reddit account?",
            "Lol fuck you",
            "Nerd.",
            "Are the  people into fireworks the same people that are complaining about trash in the river, cause ..👀",
            "What if I'm homeless and I light fireworks inside the city is that OK? It's not my fault I have trauma and can't be held responsible for my action.",
            "Bonus points if they're pointed at a friend..... PSA!!! This is important!!! \nBelow the face only!!!!!\nYou don't want to put an eye out.",
            "Rockets red glare baby! ",
            "I'm kinda shocked that I'm seeing all this care for our animals, whom we love, but we just dgaf about the veterans and others who can spend hours in their own personal hell when those explosions go off.",
            "If the vet is unavailable some CBD dog treats help as well. My dog hates fireworks but she also hates thunder too.... And it helps for both.",
            "[deleted]",
            "This guy doesn't America",
            "Good. Loser. ",
            "Perhaps they've never been seen lighting them.  I think that's how the fine works.",
            "Sounds like somebody is jealous of the real freedom of the bitterroot. ",
            "Oh man, I’m Downvoted for being a snarky fuck.  I’m not jealous…well maybe a little about the fact that people can stay up past 10",
            "It sets off a lot of Veterans also. As much as I enjoyed fireworks as a kid, I really with we would move past them. Drone shows would be cool.",
            "Ditto. I'm so over them. Drone shows are so much more fun and are cheaper in the long run.\n\nI find it super ironic how China-hating patriots celebrate with fireworks. I feel so bad for veterans with ptsd around firework season.",
            "Try getting a real dog",
            "As long as at least 4 of those beers go to the dogs. I’m sure they wanna party too. Lest we forget who let the dogs out….🫣",
            "I had my youngest kid on July 5th, it's been an interesting couple of years 🤷🏼‍♀️",
            "I remember when my kiddo was a baby and having the same problem. I also remember feeling bad for wishing my neighbors would just STFU. Best of luck this year!",
            "Exactly. I’m so sick of a world that caters fully to damn dogs and forgets humans exist too.",
            "You're right, Biden does control the prices of fireworks in China. As another person commented, a good portion are cheaper this year.  Sounds like some people may not know where to go.",
            "True, they can. Great ideas for safety and support are bracing them on several sides to prevent tipping.  Depending on the size, cinder blocks work great too!",
            "Shut up, fireworks go up and dissolve into patriotism. ",
            " it’s nothing political, both are their own type of issue! there’s no reason to compare apples to oranges. the animals are still gonna have to listen to the fireworks just like everyone. \n\n i simply mentioned keeping animals inside because they have the cognitive level of a 1-2 year old human and cannot verbally express to us their needs. i understand not all veterans have had the access to mental health help but i do believe a majority are more cognitive than a furry friend and are capable of planning ahead. now this is obviously not speaking on every veteran. i also take into consideration not every veteran is triggered by fireworks. (my grandpa being one example) \n\n the fireworks will also affect neurodivergent folks where loud sounds can be painful, the wildwilfe here will be panicked, and it’s going to affect the homeless. it’s a collective issue. we can’t control everyone who is going to run fireworks, all we can really do is plan ways to reduce stress. we can find little ways to have some control in our environments. that’s all!",
            "If i remember correctly, Pink Grizzly was kinda grandfathered in because it's zoned agricultural and considered county. It cannot be annexed into the city without being rezoneed. That's why they are able to sell within the city limits.",
            "If America means spending money on Chinese made fireworks nope. Oh the irony Patriot!!!",
            "Lol, the days of fireworks triggering vets will be a thing of the past. Wait 10 more years vets will be triggered by drone whizzing sounds. Refer to footage of Ukraine for sources.",
            "You know they tend to take after their owners. Need earmuffs and special harnesses etc.. ",
            "You go glen coco!",
            "Dogs, babies, children, VETERANS WITH PTSD. No big deal.",
            "Dog people are fucking insane narcissists that project their own lives onto their pets. Seriously the weirdest self absorbed people I know, who pretend they love their pet so much.",
            "so yes",
            "Truth",
            "I am a pet owner, and I say have fun enjoy those fireworks!! My dog goes in their kennel when their scared! Altho I do understand and empathize with the vets, if the sound triggers them they can wear noise canceling headphones. I'm not trying to sound like an insensitive Ahole.  I personally don't light off fireworks, but enjoy watching them! I would prefer just the big display of them and not everyone lighting them off all day and night for a week!",
            "Haha! The number of downvotes on your and my comments demonstrate exactly what was said. “Don’t you dare criticize my dog, even if it tries to eat your leg.”"
        ]
    },
    {
        "title": "Well the Jacob’s Island dog park is on fire",
        "score": 32,
        "date": "06-25-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1dnsil7/well_the_jacobs_island_dog_park_is_on_fire/",
        "num_comments": 48,
        "comments": [
            "Holy crap I was going to go there today, glad I didn’t. My dog is dumb and would 110% catch fire."
        ],
        "replies": [
            "I was there when it started. Walked past the area and five minutes later 8' flames.\n\nIt started in/around the dry creek bed",
            "There's been a huge log jam in there for years drying out.  If that goes up, it'll be a hell of a bonfire.",
            "Some teenagers also started a fire down by the beginning of the river front trail by the beach area today! Luckily, a lady forced them to put it out and called the fire department before it got out of hand.",
            "Anyone have pics?",
            "Wait, what?  I was just there like 3 hours ago...",
            "I was wondering when some dumbass was going to light a bunch of cotton on fire to see what happens.",
            "Again?!?",
            "They are why we can't have nice things.",
            "I have difficulty wrapping my head around this, why are kids walking around setting fires? Its the dry season, you could literally kill people. ",
            "Fiery but peaceful youths",
            "They’re just trying to stay warm at their campsite, bigot. ",
            "Pride month.",
            "This had me rolling. Sounds like an adorable puppy",
            "Police are looking for a group of teenagers.",
            "Ooh I love a good bonfire!",
            "🇫🇷Carahn 🇫🇷oui oui",
            "Fire started 2 hours and 59 minutes ago",
            "You are now a suspect",
            "Yeah! Dogs ruin everything",
            "Kids , fire.   Could be harmless could be a really bad individual.  From a Psychological stand point the need to engage in arson and the need to ingage in murder, come from the same parts of the brain. ",
            "It was a group of teenagers according to police.",
            "Ya, cooking food is such a lame thing to do. Just don’t eat like all cool people ",
            "like genuinely what do you even mean by this",
            "I saw them.when they arrived, they walked through the o'rielys parking lot when they left if they helps.",
            "Aren't we all?",
            "I’ll grab the hot dogs and smoke supply’s i can also provide some good weed ☺️",
            "\"Law and order chimes\"",
            "Some people don't deserve dogs",
            "Explains a lot about those fire murders I use to do",
            "So future homeless - at least they’re getting off to a good start. ",
            "What? Teenagers don't get cold?",
            "I've cooked food over open fire hundreds of times, and I've never started a wildfire.",
            "Intermittent fasting it’s all the rage these days. Homeless were trend setters ",
            "\"Flamers\" is my best guess",
            "Hope Albertsons got them on the camera",
            "Haha\n Fantastic. ",
            "/r/usernamechecksout",
            "Some dogs don't deserve people",
            "Congrats? \n\nNot everyone has been raised or trained about fire safety, and not everyone remembers to do things right when they’re sleeping on the streets and homeless\n\nEver do so under duress? Or are we talking relaxation trips? Maybe extra hungry? Depressed as fuck because you just lost a job and/or a house?\n\nAll those things considered, and fires like this is exactly why we need to provide housing for people. It’s a predictable and understandable consequence when people are homeless ",
            "I’d be amazed if you literally knew two whole facts. Like in your whole history. You have zero idea what’s up and what’s down. But keep at it, weirdo….",
            "They also started the holes in your pants trend!",
            "??",
            "😂😂😂",
            "Man I’d really impress you then. ",
            "That was an adventurous idea!"
        ]
    },
    {
        "title": "Pizza place by TnC is on fire",
        "score": 85,
        "date": "06-08-2024",
        "url": "https://i.redd.it/rvyakw6kw85d1.jpeg",
        "num_comments": 32,
        "comments": [
            "I’m glad I can always count on the Missoula sub as my local news source"
        ],
        "replies": [
            "That sucks so much, those poor people!",
            "Crazy I just saw a Dominos vehicle in an accident too. Bad day to be in the pizza business.",
            "It's a real bummer I feel like they just opened a month ago. Had me sweating because I love the tnc",
            "Does this count as a structure fire or a vehicle fire?",
            "I don’t know how or why a city I have never been to keeps popping up on my Reddit feed, but I hope everyone is ok! lol",
            "Papa Murphy's take and bake?",
            "It's a wood fire pizza truck, might just be the oven smoking up. \n\nI had them Wednesday, $5 for a slice and it honestly tastes like a frozen pizza crust. It's definitely not worth the price imo.",
            "I saw the aftermath of it this morning. Eerie",
            "Microwaved Tombstone pizzas must be really flammable.",
            "What is Tnc?",
            "You mean Papa Murphy's? What other pizza place is by there?",
            "Oh geez, TnC...",
            "That thing torched. How did you get a photo with zero flames? 👎",
            "It's better than pretty much anywhere else",
            "Literally just said this to my friend tonight",
            "Wait till you hear how the news was created. Crazy.",
            "Was that the one on broadway?! I saw it too",
            "Yes",
            "It got dispatched as a structure fire due to the exposure to the T&C. Luckily it was knocked down before spreading to the structure.",
            "No, it's a food truck right outside town and country lounge.",
            "Happy Cake day!",
            "No. There were legit flames, a fire truck spraying water, and police redirecting traffic shortly after this pic",
            "Lol $5 dollars a slice is literally insane.",
            "Thick n Cloudy. Iykyk",
            "Town & country lounge. A lot of people shorten it to T&C or TnC",
            "There was a food truck in the parking lot of town and country. They only started a few weeks ago too.",
            "It looks like there are massive flames coming out of the front of the trailer.",
            "Props to the guy on the motorcycle who rode by and quipped, \"Man, that sure is some hot pizza!\"",
            "Isn't the Bridge like $2.50?",
            "Oh!  It’s that bar by good food.  Never been.",
            "Oh damn."
        ]
    },
    {
        "title": "Red Comet Fire Extinguisher For Sale",
        "score": 0,
        "date": "05-14-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1crl3w7/red_comet_fire_extinguisher_for_sale/",
        "num_comments": 0,
        "comments": [],
        "replies": []
    },
    {
        "title": "what’s up with the fire dept boats near orange st bridge?",
        "score": 1,
        "date": "05-06-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1clnezh/whats_up_with_the_fire_dept_boats_near_orange_st/",
        "num_comments": 5,
        "comments": [
            "Training"
        ],
        "replies": [
            "[Missoula firefighters to start Clark Fork River training drills](https://missoulian.com/news/local/clark-fork-river-rescue-training-drills-missoula-firefighters-emergency/article_101fff26-08b1-11ef-8524-8fd8e0178806.html)",
            "They are collecting the sacred river water to preform the rites of the firefighters",
            "Train(ing)",
            "Always"
        ]
    },
    {
        "title": "Is it illegal to have a backyard fire in a fire pit",
        "score": 0,
        "date": "04-15-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1c48tdr/is_it_illegal_to_have_a_backyard_fire_in_a_fire/",
        "num_comments": 38,
        "comments": [
            "Technically in the city it is, now I'm going to piss off a lot of people saying that, but it is. Will the fire department issue a citation, not generally. There's a lot of looking the other way and claiming that people are using the fires for \"cooking\" which is a little loop hole. People here think it is an inalienable right though so watch out. You're opening up a hornets nest by asking."
        ],
        "replies": [
            "Have some hotdogs on a stick nearby... It's legal if you're cooking food.",
            "Naw mafucka, rip it up! Bums are shittin on the sidewalk; you can have a lil fire as a treat.",
            "This is Montana, laws and regulations are for Karens and Californians who dont like us and want an excuse to throw a temper tantrum because its not the bay. Do what you want, just do it responsibly.",
            "Not hot dogs, marshmallows. Less listeria.",
            "Don't be a snitch, OP.",
            "Keep a pack of hotdogs out incase the fire department shows up so you can say you are cooking",
            "[there are rules, but don't be a dick ](https://www.missoulacounty.us/government/health/health-department/home-environment/air-quality/outdoor-burning#:~:text=Per%20the%20Missoula%20Municipal%20Code,prohibited%20inside%20Missoula%20City%20limits.)",
            "Just be careful. Your neighbors may complain if they are not cool with it. As others have already mentioned, keep some hotdogs nearby. Make sure you don't leave it unattended. When you are done, use water to put it out and stir it thoroughly. Just use common sense, and you should be fine.",
            "Backyard fireplace food>Conflux",
            "Depends. Are you homeless? If yes then you can do whatever you want.\n\nBut seriously though I'm pretty sure open flames in city limits are technically illegal but nobody is enforcing it.\n\nhttps://www.missoulacounty.us/government/health/health-department/home-environment/air-quality/outdoor-burning#:~:text=Recreational%20fires%20are%20allowed%20outside,prohibited%20due%20to%20fire%20danger",
            "If you have a bag of marshmallows or hot dogs next to it then you are technically fine . ( firefighter told me this ) just keep the hose nearby.",
            "It is illegal, but they happen anyway. I would check the smoke path to make sure you're not smoking anyone out like the neighbors. Or maybe get a propane firepit? My neighbors had yard fires, but the smoke came directly in our house and lingered for a day. After living through years of smokey summers, wood smoke makes me want to run away when I smell it. I guess just be considerate that most of us live in an urban environment and wood smoke doesn't know boundaries.",
            "May be illegal. But we do one almost every weekend in the summer",
            "Don’t burn stuff like garbage, leaves or anything that’s going to cause a lot of smoke or toxins in the air and nobody will care. Start stinking up your neighborhood and people will flip",
            "Yes, unless it’s for cooking. Just keep a hot dog nearby and you’re fine.",
            "Being as the fire dept cannot keep up with the influx of calls, just talk to all of your neighbors or simply don’t have a fire, it is very bad use of resources.",
            "Yes. We live in an air stagnation zone. We just emerged from a winter-long inversion and have a brief window of good air quality before fire season. Please help keep it clean.",
            "Several years ago a friend of mine called the fire marshall to ask.\n\nThe marshall told him, \"Technically fire pits are illegal... just be smart about it and don't make it our problem.\"",
            "I don't mind them but I don't have any other way to cool my home than to open the windows.",
            "My friends had the same bag of hot dogs sitting by the fire pit for the whole summer. They had a shitty neighbor who would call every time they had a fire!",
            "[deleted]",
            "Or some sort of holy book/text. Religious purposes.",
            "I'm someone who definitely asks for permission and not forgiveness, and I've missed out on a lot of things because of it. Maybe \"Bums are shittin in the sidewalk\" should be my new mantra for seizing the day.",
            "This is the Answere.",
            "No I’m asking bc I want one lol",
            "*’Depends. Are you homeless? If yes then you can do whatever you want.’*\n\nUnfortunately 100% true",
            "This is why nobody invites you to their BBQ.",
            "I like that answer.",
            "Some people think they are being smart about it when they are not that’s probably why it’s illegal",
            "Yeah \"Barbeque\" is not considered a burn pit by Missoula code.",
            "You need that kinda flame for the burnt offerings.",
            "Crape Diem my dood!!!!",
            "[deleted]",
            "I have eaten roadkill deer yes, waste not want not. You can file for the permit online and you must acquire it within 24 hours of harvest.\n\nhttps://fwp.mt.gov/buyandapply/vehiclekilledsalvagepermit",
            "[deleted]",
            "Plenty of good meat on a fresh vehicle kill not like it's been sitting there all week.",
            "[deleted]",
            "I am 150% serious and I promise a vehicle kill tastes no worse than a trophy buck and you wouldn't be able to tell the difference.",
            "[deleted]",
            "Is this one of those reddit suggests threads from arbitrary communities you've never been to things?"
        ]
    },
    {
        "title": "Looking for smoke buds today any takers",
        "score": 0,
        "date": "04-10-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1c0zknh/looking_for_smoke_buds_today_any_takers/",
        "num_comments": 12,
        "comments": [
            "Nice try officer"
        ],
        "replies": [
            "My roommate is a pretty heavy smoker but I’m not. Both of us also mentally well seasoned, I’m a huge nerd and she’s bigger into music and herbal infusement",
            "Where do you smoke?\n\nI'm always wondering where you can smoke pot without bothering other people with the smell and/or coughing.",
            "LGBTQ safe?",
            "Any tokers?",
            "Bro it's legal now",
            "Lmao no just bored AF but it really does look like that",
            "Depends, rarely out in public for that reason lol, just kind of think of it as 'would bother folks if you smoked a cigarette where you're' at kind of thing",
            "i’m so confused why this got downvoted",
            "Yes we're both queer",
            "Sad that this got downvoted :(",
            "Not much so far"
        ]
    },
    {
        "title": "Coconut Cold Smoke",
        "score": 2,
        "date": "03-23-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1blfbjn/coconut_cold_smoke/",
        "num_comments": 12,
        "comments": [
            "They discontinued it along with the vanilla and cherry coldsmokes. If i remember correctly, it was a series to see which was going to be the new limited release they would continue every year, and coffee won hand over fist above the rest."
        ],
        "replies": [
            "They do whiskey aged, chocolate and vanilla on tap in Bonner. They brought cherry back for little but redid the recipe and also did pumpkin. They also have blackberry on Bonner as well",
            "The pumpkin is great..I loved the coconut back in the day",
            "I suppose if they never make the cherry one again either, it'll be worth it.  ",
            "They sell the vanilla one in single cans at the taproom in Bonner. Not sure about the other old flavors though",
            "Yeah, the whiskey barrel aged is also in bombers around here. It's good, but expensive.",
            "It was disgusting, i wasn't a fan of the other two, but that one i couldn't finish in any fashion.",
            "I was wondering about those, i know they do pints in house on the tap from time to time. But not frequently enough to say for certain.",
            "Is the coffee decent?",
            "I live for it, dare i say it's better than the original",
            "Is it always available or seasonal?",
            "Seasonal, starts late fall and goes till it's gone. Usually around this next month or so is the last of their stock pile, a few years back i found some stragglers in a random gas station in june, but typicially, this is the end of the end of the season around now."
        ]
    },
    {
        "title": "There were 5 police cars, an ambulance, and a fire truck all racing down reserve around noon. Anyone know what happened",
        "score": 0,
        "date": "03-16-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1bfv6t8/there_were_5_police_cars_an_ambulance_and_a_fire/",
        "num_comments": 13,
        "comments": [
            "[removed]"
        ],
        "replies": [
            "I was listening to the scanner. It was the trains.",
            "I betcha they all got a call that something was happening so they all started racing down reserve in the direction of said happening",
            "Normally first responders respond to a emergency so I’m guessing it was a emergency or some other type of incident 👍",
            "It was me, I took a dump in the winco bathroom.",
            "They went into a bar?",
            "🤦‍♀️ at all you “helpful” Folks",
            "Ohhh, Creed.  😀",
            "I’m pretty sure none of that’s real.",
            "Gonna send the fucking navy up the pipes if we catch you again",
            "Not again?!?",
            "Haha. Exactly what I was thinking!",
            "You’re not real man!"
        ]
    },
    {
        "title": "About 8 fire trucks on Trotting Horse Ln",
        "score": 0,
        "date": "01-31-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1af8pjf/about_8_fire_trucks_on_trotting_horse_ln/",
        "num_comments": 1,
        "comments": [
            "Not sure, but it was a spooky scene through all that fog"
        ],
        "replies": []
    },
    {
        "title": "Cold smoke",
        "score": 11,
        "date": "01-30-2024",
        "url": "https://www.reddit.com/r/missoula/comments/1aesy9w/cold_smoke/",
        "num_comments": 39,
        "comments": [
            "In Montana it’s technically illegal to ship alcohol, so you’re unlikely to find a “service” they will do this for you."
        ],
        "replies": [
            "Sounds like a good opportunity for a Smoky and the Bandit type of situation",
            "You pay for the beer and shipping and I’ll send a few cases your way.",
            "Damn there’s gotta be an easier way to give yourself a headache",
            "Go talk to your liquor store. They have the rights to have alcohol shipped. When I lived in Vegas and wanted cold smoke I talked to them and we worked out an amount that would be worth their wild and got my cold smoke.",
            "Feel your pain. I miss the hell outa my favorite Asheville beer; Highland Gaelic ale. Unfortunately it is against regulations for individuals to ship beer through USPS, FedEx or UPS. Unless you got the Bandit's number and can afford a whole truck load I'm afraid your out of luck good buddy.\n\nMaybe talk to your local retailer about getting a shipment in for you? Unfortunately MT's archaic beer laws do limit how much Kettlehouse can produce.",
            "Lol.  I've been looking for it outside of Montana for over a decade.  I feel your pain.\n\n\nUnfortunately outside of taking up the user offering to mail you some, you're not going to find it.",
            "no way that is worth it.  Cold smoke is great, but you can get great beer anywhere in America these days, I mean, at least you can in North Carolina.",
            "I always bring some to bf in Washington State.  He loves it...and can't get it there.",
            "What’s your location",
            "My husband is from NC & every time we fly back we pack Coldsmoke for a friend who loves it, too! Wish we could help ya out!",
            "I drive for fedex. Probably deliver about 15 packages of wine a day that day exactly what they are on the box. It’s got to be legal or completely unenforced.",
            "Cold Smoke is the best beer ever made. It has been the only beer I order every time I go out for about 15 years. And Im a little ashamed to say that I'm getting sort of tired of it.",
            "You can fit a 4-pack in the flat rate medium priority boxes.  Just make sure they're double bagged in freezer ziplocs. Think it's $12.95 or $15.95 for the shipping?   Hard to imagine it's worth $30 plus whatever a mule would charge you to package and drop off, but if you really want it, DM me.",
            "[deleted]",
            "Am I the only one who thinks cold smoke is not as good as it was 5 years ago?",
            "OP here, to follow up. I had several people offer to help out. Cold smoke on the way. Thanks so much to you wonderful people in Missoula.",
            "You could easily put em in a box and UPS them and no one would bat an eye",
            "Not if Buford T. Pusser has anything to say about it.",
            "Can I get in on this action?",
            "It can only be shipped to your state if the brewery has applied to be distributed in that state.",
            "According to their faq page, it’s sold in parts of Washington, Idaho, Wyoming, and Utah.",
            "I’ve drank a lot of scotch ales and zero have come close to Cold Smoke.",
            "According to their website, it’s sold in eastern Washington",
            "One of the first times I had cold smoke was in Seattle😂",
            "Hard disagree. I try every one I come across; cold smoke is the best by a long shot.",
            "It’s still the same BUT it’s the only beer I know of that the flavor changes drastically after just a few months sitting in a can. If you aren’t looking for the most recent born on dates on the cans or boxes you can’t call yourself a real Cold Smoke drinker. Side note: WHY do all the cans I longer have born on dates stamped on them ?",
            "[deleted]",
            "Since it’s pressurized, you’d need to declare it as hazmat, which comes with a whole host of other issues. Not really worth it for some beer.",
            "Well that makes me angry.  Lol.  Apparently I moved out of Washington just in time for it to be an export. :/",
            "Hes in Sunnyside...never found any in Kennewick,  there or Yakima.",
            "WHAT? i live in seattle now and im curious. where can i find a piece of my culture??",
            "100% correct",
            "Solid tip! Thank you!",
            "I mean, not quite apples to apples but okay",
            "Oh trust me I know it doesn't make it right, but can still be done as all I'm saying. Depends how badly you wanted coldsmoke lmao",
            "It said only eastern Washington, so maybe you didn’t have a chance regardless lol.",
            "Near the troll as well as I think in the beer district it was three or four years ago, so hard to say",
            "It was a while ago, but it was at a smaller beer specific store that carried a bunch of imported beers",
            "Oh...\n  Nope.  I went for the coastal half.  Don't regret it, but I do regret the lack of Cold Smoke.\n\n\nSide note...Cold smoke with a float of Flathead Cherry Ale is...*gah*.  It lives rent free in my head.  Now I'm in the Midwest so *both* are just a pipedream memory.",
            "ballard?"
        ]
    },
    {
        "title": "Santa Firetruck event on Russell by the YMCA?",
        "score": 1,
        "date": "12-11-2023",
        "url": "https://www.reddit.com/r/missoula/comments/18g5dp3/santa_firetruck_event_on_russell_by_the_ymca/",
        "num_comments": 1,
        "comments": [
            "They’re not doing it there again this year. They did it at the Holiday on Higgins event couple weeks ago."
        ],
        "replies": []
    },
    {
        "title": "Why are there no 24 hr smoke shops ???",
        "score": 0,
        "date": "11-24-2023",
        "url": "https://www.reddit.com/r/missoula/comments/182lz3l/why_are_there_no_24_hr_smoke_shops/",
        "num_comments": 27,
        "comments": [
            "[deleted]"
        ],
        "replies": [
            "Not what pure o whatever says, it’s due to MT law. Not allowed.",
            "Nothing is open at night in Missoula. I work nights, and trust me when I say I'd love if a dispensary was open overnight. \n\nTaco bell isn't even open late, anymore. Fucking covid.",
            "Because Montana potheads actually sleep at night?",
            "Its the law, nothing to do with smoke shops",
            "Because 24 hour businesses are terrible for workers",
            "Why is it so hard for people to make sure they have enough during daylight hours lol",
            "Because there isn't demand for it. They'd get next to no traffic at late night.",
            "In the immortal words of Richard Pryor \"A wino ain't afraid of nothing except for running out of wine\"...",
            "Because laws",
            "Nobody needs to smoke at 4am?",
            "Sounds like someone's vape died after mellow mood closed for the evening",
            "Because with the most rudimentary of plans, you can avoid needing to be in a place like this in the middle of the night.",
            "They'd get robbed",
            "I often wonder why the foggy mountains breaks me?!?!",
            "But people need their Kratom or they get cranky",
            "> Taco bell isn't even open late, anymore. Fucking covid.\n\nRIP to 24 hour businesses in Missoula.",
            "Blew my mind when I went to a Billings taco Bell at 2am , both lines packed to the brim. They close at 4AM!!! Meanwhile on east Broadway you'd be lucky if they were open past 7pm. What a joke",
            "I’m feeling well rested and called out.",
            "Because it’s dark when I get to work and dark when I leave 😂",
            "Ehhh you sure about that dude",
            "🤣🤣🤣🤣",
            "You can get get Kratom at Fantasy. They’re open late.",
            "Thank god for WinCo. I work night shift and it’s a godsend! Night shifters really got fucked after Covid.",
            "Hahaha, I love your sense of humor and being able to laugh at yourself, it's one of the things I love about Montana and the people who live there.",
            "Ever have a day off? Lol",
            "Truth. That 3am Taco Bell hit different, and the reserve graveyard crew was awesome as hell."
        ]
    },
    {
        "title": "Smoke up the Rattlesnake?",
        "score": 0,
        "date": "10-24-2023",
        "url": "https://www.reddit.com/r/missoula/comments/17fqjxf/smoke_up_the_rattlesnake/",
        "num_comments": 11,
        "comments": [
            "that was me and me homey, Alan Tamarack blowing fat blizzies fir a few days. whaaaaahhhhh! Stay good☝️"
        ],
        "replies": [
            "It has been smoking for two days. It is slash. There was an article somewhere or other about it but I decided not to post it because I was getting called a news bot.",
            "Thanks. I missed that article so I don't mind if you post it lol",
            "Good bot",
            "beep bop boop or something or other https://www.kpax.com/news/missoula-county/slash-pile-burning-planned-for-mount-jumbo-wildlife-management-area-near-missoula",
            "Are you sure about that? Because I am 99.31441% sure that Stadshond_van_de_die is not a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)",
            "Don't you have anything better to do? Oh look, an optout option. :P",
            "[deleted]",
            "[deleted]",
            "Are you sure about that? Because I am 99.99999% sure that BoozeIsFoods is not a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)",
            "Are you sure about that? Because I am 98.99236% sure that Stadshond_van_de_die is not a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)",
            "Thank you, FourOhhSix, for voting on Stadshond_van_de_die.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
            "Bad bot"
        ]
    },
    {
        "title": "Anyone just see that airplane fly super close to the M? Black smoke on it...",
        "score": 24,
        "date": "09-24-2023",
        "url": "https://www.reddit.com/r/missoula/comments/16r7hot/anyone_just_see_that_airplane_fly_super_close_to/",
        "num_comments": 15,
        "comments": [
            "Saw a C-130 flying north quite low. ANG plane training most likely. Those engines notoriously smoke. Probably nothing to be worried about."
        ],
        "replies": [
            "I think I found the flight tracking for it. Looks like it landed safely in Glacier. Got pretty damn low though.\n\nhttps://www.flightaware.com/live/flight/VADER08\n\nhttps://www.flightradar24.com/2023-09-24/20:01/20x/VADER08/322a5c3f",
            "I didn’t think it was going to clear one of the mountains in East Missoula. I was bracing myself for a crash, but never heard one.",
            "that was pretty nerve wracking, looking forward to an update",
            "I was at Lolo Peak Brewery and saw it come over low like it had just come down off the pass, and it was banking pretty sharp for a big plane as it turned north toward Missoula.  Gray, looked like a C-130 but I'm no expert.  It was low enough that we could feel it.  Probably some military pilot hot dogging it.",
            "i saw it from the university district. military cargo plane pretty low and banked unusually hard to the east like almost wings vertical.",
            "Yes, hope it made a safe landing",
            "Ditto went looking for a plume for a crash ND didn't see anything westbound",
            "I just saw it in Bonner as I was driving west on 200! About 2:15ish",
            "What did it look like? A mostly white small plan flew over our place up towards rainbow bend. Super low just above the trees.",
            "Shouldn't be legal to fly plane training exercises over a city. That low especially. Not to mention I have never seen anything life that in over 30 years of living here",
            "I watched it from Bonner, was relieved it didn’t crash into Mount Sentinel. Looking at the tracker it appears it was as low as 500 feet above ground. That’s pretty wild.",
            "It did, flew over Lake Blaine heading for Glacier International",
            "They flew a C130 through hellgate canyon a few years ago.\n\nThat was pretty neat",
            "word."
        ]
    },
    {
        "title": "Anyone know where smoke is coming from today in Missoula?",
        "score": 9,
        "date": "09-20-2023",
        "url": "https://www.reddit.com/r/missoula/comments/16nos88/anyone_know_where_smoke_is_coming_from_today_in/",
        "num_comments": 20,
        "comments": [
            "[deleted]"
        ],
        "replies": [
            "https://fire.airnow.gov. <- save this link.",
            "I went to Starbuds. Sorry.",
            "Bitterroot Forest is conducting prescribed burns too. It's a bummer for me with lung disease. Will be indoors all day with windows shut. Since we are going to see more prescribed burns in addition to smoke from forest fires, I'm considering the real possibility of moving.  The affect of smoke on our lungs doesn't seem to be considered.",
            "The crackheads",
            "Bum camps",
            "Winds are bringing California and Oregon wildfire smoke across the pass.",
            "Its the last couple weeks before it gets to wet or cold to get rid of the Slash piles on properties along with it being tree 1st cookie night of the year",
            "Right",
            "Thanks for the info!",
            "This seems like a lot of smoke for prescribed burn",
            "Thank you kindly!",
            "Lol",
            "Air quality is taken into account for these things. A lot of burns don't happen because of the strictness of our AQI. But if it's a real problem for you, I would consider it. Missoula's valley and inversion later is never going to change and land management targets to decrease fuels around Missoula aren't going to lessen anytime soon. \n\nEdit- I really recommend the airnow.gov website some else recommended. You can see the blob over the Bitterroot that extends all the way up to the Canadian border almost. Which means the local burn contributed but there are other factors at play. \n\nNorthwestern offers a $100 rebate on the purchase of an energy-star certified air purifier and it is so worth it. It took me almost ten years to get one and I really recommend it! You can pay almost anything for one, but plenty of good ones are right around there so you can basically get one for free. The paperwork part was really easy and it just shows up on your next bill as a credit.",
            "There's going to be fires all the time, doesn't matter the season or if it was on purpose or not. It's you vs the forest forever if you choose to stay.",
            "I’m sure you already know and it’s maybe not protective enough for your condition, but just in case you don’t know .. N95 masks filter the smoke pretty well .the Aura ones from 3M are easier to breathe through also",
            "We can only hope",
            "How does a prescribed burn produce less smoke than a random start? It's the size and proximity along with weather patterns that determines the level of smoke in the valleys. \n\nInversion is holding it in.",
            "Can't use them, but thanks for the suggestion. I can't breathe when I wear them. I guess that means they work. 😆",
            "I was just thinking, typically prescribed burns are smaller, there’s a lot of smoke in the valley right now, your probably right about the inversion totally slipped my mind",
            "I understand.  I have POTS and some days they make me lightheaded. Even the good masks. But I prefer them over smoke or Covid.  But I do get it"
        ]
    },
    {
        "title": "Fire Levy Pulled",
        "score": 12,
        "date": "09-19-2023",
        "url": "https://missoulacurrent.com/taxpayer-fire-levy/",
        "num_comments": 29,
        "comments": [
            "Fire fighters is one of the things I expect them to fund. Putting this off doesn’t seem like a good idea"
        ],
        "replies": [
            "Sounds like we need to build another homeless shelter or two, or three",
            "[deleted]",
            "Just a smokescreen for that ridiculous city budget increase they passed. They know we won’t vote to raise our own taxes. Guaranteed they are working on funding these without our consent.",
            ">A proposed levy intended to improve fire and emergency response across Missoula by establishing a new fire company and station in the Mullan area was pulled from the November ballot on Monday night.\n\nThere's already a fire station in the Mullan area.  This levy was for 7 million dollars per year.  \n\nHow many structure fires does the current Mullan station put out every year?  How much better would the response times be by having another station in the area?  How many structures would be saved per year by having the better response times?\n\nMight it be cheaper to just pay to rebuild any homes that are lost to fire rather than to pay 7 million dollars per year for the new station?",
            "Missoula City and county have spent so much time trying to make Missoula attractive to outsiders, that when it worked, they don’t know how to stop. Everybody in the country knows now and moved here. I’m working 8-5 and can’t mountain bike all day at Marshall Mountain. Quit catering to the trustafarians and provide basic services to the citizens. Please. The sunken cost fallacy with all of these studies that they commission is that then since they spent the money already, we MUST move forward and ask for more. Every 3 years they want to change traffic patterns. There are consulting companies raking in money every day from Missoula’s “studies”",
            "The council knows that changes are coming with Hess going. They will do whatever they can to save their own positions.",
            ">City officials said they were left with no choice but to pull the measure after citizen outrage over the state's estimated tax bills and the Republican Legislature's failure to heed the warnings from the Montana Department of Revenue over inflated property values in the 2023 session.\n\n>“The state Legislature has created an absolutely untenable situation from a property tax standpoint, and has created a massive tax shift to residents,” said Mayor Jordan Hess.\n\nThis is why you aren't going to be Mayor anymore Jordan. God just once I would like to see one of these weasles on the city council take some responsibility for their own ineptitude. \n\nI hope everyone that supported the Johnson street shelter is happy that our fucking fire department is underfunded now so a bunch of bums can happily shoot up all winter.",
            "The right is growing in power in Missoula. It’s palpable.",
            "I wouldn’t worry. Fire departments, especially urban ones, barely fight fire anymore. They mostly clean up car accidents.",
            "The tax shift was actually caused by the legislature cutting taxes on tax classes. Levies happen when the jurisdictions budget has to be balanced but the normal tax revenue isn’t there. Business property tax dropped to 4% this last session residential raised to 52%. Vote better next time if you don’t want higher taxes.",
            "Sounds like you might appreciate the ideas from Strong Towns. \n\nhttps://www.strongtowns.org/about",
            "I rarely agree with you, but this I believe, they will shove it in somewhere.",
            "Missoulians historically almost always vote to increase our own taxes. Just saying.",
            "Lol, they’re all elected officials. That’s consent. \n\nPlease identify what is so ridiculous in the budget. Specific budget items please. Not that it went up. Can you tally up enough to not get a tax increase?",
            "Yes, there is a station on Mullan, but that is staffed by the rural fire dept. They cover Missoula county, not the city. Much of the newly developed land out there has been changed from rural to city limits. So the closest responding fire station is quite a ways away. Thus, slower response times. \n\nSo we’re clear, we’re not just talking about rescue from fire, the firefighters are all EMS providers as well (EMTs or paramedics). So they respond to every medical call within the city. Conservatively, that’s over 8,000 EMS calls alone each year. Car wrecks, cardiac arrests, shootings, you name it.",
            "[deleted]",
            "[deleted]",
            "I’d give you an award if I had points left. 💯 so glad Hess is OUT. “Now so a bunch of bums can shoot up all winter.” Exactly…I’m so sick of it",
            "And help old ladies off the floor/toilet (“lift assist”).",
            "Do you have more information on this process and how it works? Just starting to learn about it, and it seems murky, and potentially a place where corruption can easily hide",
            "If I do identify specific budget items, does that mean that they will go away? \n\nIf not, why would I waste my time doing that on reddit?",
            "Every medical call is generally responded to by both a fire truck and an ambulance.  Surely we could save some money by eliminating that redundancy.",
            ">How many years is the levy for? \n\nI'm not sure since the article doesn't seem to say, but I always assume that any new tax will be permanent.\n\nA volunteer department makes sense, given how few emergencies probably happen in that area.",
            "Yes, that proves my point. After the tax increases, Hess emergency Levy, the Johnson Street shelter fiasco they knew they had to.",
            "For sure, it is murky. The Legislature caps the amount local governments can raise from property taxes. When the Legislature cuts the tax rates for some property classes, the total taxable value in the entire local jurisdiction decreases. When the taxable value goes down, so does the amount of revenue for that jurisdiction. The local jurisdiction would have to raise its mill levies on all property owners to maintain revenue levels. The increased mill levies are then applied to the remaining property in the jurisdiction, most significantly to residential property. As a result, local revenue remains constant, but the obligation to support local government functions shifts to homeowners and other property owners.\n\nDetermining what the property taxes will be on a piece of property is complicated and requires a series of steps. The Department of Revenue is responsible for appraising – or valuing – property in the state to determine the market value. The Legislature then assigns a tax rate to each class of property and multiplies that tax rate by the property’s market value to determine the taxable value. Local taxing jurisdictions – cities and counties – apply the mill levies to the property’s taxable value to determine taxes owed.",
            "How do you know there’s enough waste and bloat otherwise?\n\nIt’s like when you ask people, they want lower taxes \n\nThen you ask them about cutting things that cost money, and they do t want to get rid of THAT. \n\nOtherwise, it’s a prejudice and assumption",
            "Here’s a start: cancel all contracts with consultants, and fire everyone with the word “climate” “equity” or “coordinator” in their job title. I care a lot about climate change and equity but those are feel-good do-nothing jobs and everyone knows it",
            "I know a few of those jobs are paid for with grants. They also work on grants that bring I. Millions more. Not sure we’d save taxpayer money doing this. \n\nThink we can find some agreement on some of the consulting and design work we pay for. \n\nBut we’re seriously approaching MAYBE $1/200th of the budget. \n\nWe just don’t spend that much money on those things in comparison.",
            "$111 million budget. 1/200 would be $555k. I can assure you the City is spending more than that on consultants alone, much more when you add in the do-nothing jobs. It’s an endless stream of money, often going to friends and campaign donors. A few example (note these are only contracts that made the news): \n\nhttps://nbcmontana.com/amp/newsletter-daily/missoula-set-to-hire-consultant-for-code-reform\n\nhttps://nbcmontana.com/amp/news/local/missoula-city-council-committee-to-consider-consultant-for-marshall-mountain\n\nhttps://missoulacurrent.com/missoula-clean-electricity-6/\n\nhttps://missoulian.com/news/local/city-agency-to-hire-tax-increment-financing-communications-specialist/article_02b87232-a79a-57dd-b518-ed9cd5cc873c.html\n\nhttps://missoulacurrent.com/brooks-street-study/\n\nhttps://www.kpax.com/news/missoula-county/ambitious-clark-fork-river-project-in-missoula-eyes-restoration-recreation\n\nhttps://newstalkkgvo.com/a-full-week-of-design-conversations-planned-for-mullan-road-area/",
            "For some reason I had $200m floating in my head, but is that the enterprise fund total? So ya, my percentages were off a bit.\n\nMy larger point is that it’s not enough to say, fund an expansion of fire services. \n\nBy the way, “The City of Missoula in 2021 secured $847,000 in federal funding to study the Brooks Street corridor and a proposal to convert it to a Bus Rapid Transit system, along with other pedestrian improvements” - so again, not all of this is local money. \n\nAlso, some of them are legitimate needs, or we can’t simply pretend as if we can just recoup the entire cost. We needed code reform. Doing it in house should cost less, but it doesn’t cost nothing \n\nSo like, I guess all that’s to say, I’m down to reform what we do in house, and I think we agree mostly on the specifics here - I just don’t see it fixing the problem it’s brought up to fix"
        ]
    },
    {
        "title": "Download Watch Duty for fire updates",
        "score": 9,
        "date": "08-16-2023",
        "url": "https://www.reddit.com/r/missoula/comments/15spj40/download_watch_duty_for_fire_updates/",
        "num_comments": 11,
        "comments": [
            "Inciweb is my go to.\n\nhttps://inciweb.nwcg.gov/"
        ],
        "replies": [
            "Or just check the free DNRC site",
            "Thanks OP never heard about this app very helpful.",
            "Knew it was burning, just didn't have a good idea what direction it was. Thought it would be much further west. The sudden smoke plume yesterday afternoon was impressive.",
            "Thank you! This app has everything, never heard of it!",
            "No doubt. \n\nThis app uses inciweb data (and other sources) while also having a good ui and providing push notifications.",
            "Inciweb doesn’t have information on all fires—only some of the larger ones. Watch Duty has very fast info on even the smallest of fires. It also seems to be faster with updated fire perimeters.",
            "[https://fire.airnow.gov/](https://fire.airnow.gov/) & [https://wfca.com/fire-map/montana?lng=-110.0444&lat=46.7294&zoom=6.13](https://wfca.com/fire-map/montana?lng=-110.0444&lat=46.7294&zoom=6.13) are also good resources",
            "Google Maps even has updates for fires now and you can check on Google Maps and I'll show you where the fires are",
            "It looked like a volcano. Never seen a plume quite like that one.",
            "Agree that it looked like a volcano. The lower 2/3 of the plume seemed to be glowing from inside. I think it was light from the fire reflecting off the smoke."
        ]
    },
    {
        "title": "Big knife fire",
        "score": 40,
        "date": "08-16-2023",
        "url": "https://www.reddit.com/gallery/15sdntp",
        "num_comments": 4,
        "comments": [
            "Cotton Candy of destruction"
        ],
        "replies": [
            "If I’m understanding your question, flying drones near a fire interferes with efforts to fight the fire. If the airport in Missoula detects a drone in the airspace they need to ground all of the support aircraft.",
            "Huh??",
            "You do not understand my question. Because the question is a meme. And no, aircraft do not need to be grounded if a drone is flying 20 miles LOS from the area impacted. This was a safe and legal flight as there isn't a NOTAM for the city of Missoula regarding the Big Knife fire at the moment. \n\nHere's a link if you want to learn more about FAA Small UAS Part 107\n\nhttps://www.faa.gov/newsroom/small-unmanned-aircraft-systems-uas-regulations-part-107"
        ]
    },
    {
        "title": "Fire Activity North of Missoula",
        "score": 0,
        "date": "08-16-2023",
        "url": "https://www.reddit.com/r/missoula/comments/15sbpki/fire_activity_north_of_missoula/",
        "num_comments": 1,
        "comments": [
            "Not new. Big Knife fire."
        ],
        "replies": []
    },
    {
        "title": "This Fall Missoula will place a $7 million dollar levy on the ballot to bolster the fire department and newly formed Mobile Support Teams.",
        "score": 49,
        "date": "08-02-2023",
        "url": "https://www.reddit.com/r/missoula/comments/15gao5u/this_fall_missoula_will_place_a_7_million_dollar/",
        "num_comments": 86,
        "comments": [
            "The mobile support team is amazing. It’s a social worker and an EMT. They respond to domestic, suicidal, and any other mental health calls. They are trained to deescalate and figure out resources and help the person needs. I know they were on grant money at the time, and have worked with them personally. Very compassionate people who are more knowledgeable and able to help people in crisis."
        ],
        "replies": [
            "FD wouldn't be as busy if they didn't have to suit up and roll out for every ambulance call. A better solution would be a city run ambulance company or terminating the current agreement with MESI so they can run without the FD",
            "I read this as \"The Fall of Missoula\" When has Zoo town pushed back against anything, almost everyone has been pushed out and been forced to leave unless they already bought a house 10 years ago.",
            "The rule should be that if you want to add a levy, you must get rid of one first. \n\nI used to fight fires and am empathetic, but this is too much. People are being pushed out of their homes due to their property tax burden. And yes, that happened to two of our neighbor families.",
            "If the MSTs handle issues to avoid getting police involved maybe their funding could come from the police budget instead of a new mill tied to fire.  I’d rather mills focus on one thing also.  I’ll go ahead and vote no for a $200 per Home additional tax increase.",
            "What's a mobile support team?",
            "But your property values went up! 😂 what a scam this state is turning into",
            "I see this levy is an ancillary cost of opening a second year-round homeless shelter. Somebody should get some statistics on how many times/day the fire dept has to respond to the shelters.",
            "Not supporting this levy means continued longer response times for your next heart attack, strokes and house fires. 🤔 I can understand voting down park levies and such but actual services to save lives? Crazy!",
            "Got to love this unelected mayor. Couldn’t get his pet project mill passed last year and now has got part of it forced through via his emergency declaration, and now is attaching the mobile support team to an essential service to get funding for failed mill from last year.",
            "I’d vote yes if it only supported a new fire station and more firefighters.",
            "I’ll continue to vote no to every levy as I have done for a decade plus.",
            "That's what you get with a back alley deal as Mayor.",
            "I totally disagree. First, where are you getting the dollar amount? Second, this city is in need of another fire station with a huge jump in calls over the past 5 years. Missoula fire started the MST program and it works. Missoula fire does not wait around for fires at the station, they are first responders and respond to all EMS calls, usually being the first on the scene. They are all trained in deescalation when a person is in crisis. This is all public knowledge and should be evaluated before making decisions. The future could also mean no firefighters being hired due to low wages and extremely high rentals and/or home listings. This is a scary thought with the number of calls for people in crisis rising and you all want the fire dept. to respond to your emergencies in such a fast time. Response time WILL fall if this is the case as it probably already has. Call the fire chief with these MST vs PD questions. They can let you know all the details. Also, this fire dept is,I believe 30%, under paid compared to similar departments. Fire and EMS should always come first in this city because without them, this town goes down the drain.",
            "Totally unnecessary. \n\nThe Missoula Redevelopment Agency (MRA) has been using the TIF laws to skim millions off the top of the city's General Fund for years. When I looked several years ago, they had over $30 million in their coffers. That's why occasionally you'll see the city ask the MRA for money, often to help get grants from the feds or to do some right-of-way work for rich corporations. \n\n**That money should be used for this**. They have more than enough. Sadly, the MRA is very good at covering its tracks and citizens are ignorant of the power it wields.",
            "I vote no on most every levy, but this one is important. EMS is in dire straits, especially in Montana - Phillipsburgs ambulance service just closed down last month and now they’re volunteer run, and republicans are only going to gut Medicare/Medicaid even more. As much as I don’t want to increase taxes, I like having a functional fire dept and ems system.",
            "How about we prioritize any program that promotes the safety of Missoulians? We don’t need another tax.",
            "As long as it’s not for the ineffective and lazy cops and just fire, I’m for it.",
            "With as many multi million dollar ranches out there you’d think some ceo could just write a check to be nice maybe get a fire engine named after him.",
            "No. The fire department is redundant government waste. They perform the same task as rain. The only difference is rain does it for free.",
            "[deleted]",
            "Don’t care what it’s for - no more property tax increases, people are losing their homes because of this recklessness",
            "Defund the pigs!",
            "Who replaced them? AirBNB or out of staters?",
            "You are onto something. They're most likely tying the MSTs to fire as a way to make people feel obligated to vote for it since fire departments are popular.\n\nThis was like the defeat of the new 4H barns. They tied it to a new ice rink for the hockey team hoping the 4H aspect would get it across. It didn't.",
            "I agree!",
            "A team that serves as an option to handle issues that don't need a heavy handed police presence.\n\n\nhttps://missoulacurrent.com/mobile-support-team/",
            "Apparently the Republicans are the party of tax increases now. It's definitely a narrative we are going to use for MT Dems next Fall....because it's true.",
            "Mobbed up Jersey Governor",
            "Have you read the report? Number of people in Missoula and houses increasing over the last 20 years is why we need more.",
            "chances are it'd be an ambulance responding to the first two... and house fires have gotten extremely rare and now make up a tiny percentage of fire dept work.",
            "Have you met any republicans? They routinely vote against their own best interests.",
            "Why do we need that?",
            "Same.  They get enough of our money, they just need to use it more wisely.",
            ">Missoula fire does not wait around for fires at the station, they are first responders and respond to all EMS calls, usually being the first on the scene.\n\nFrom the [City of Missoula web site](https://www.ci.missoula.mt.us/2393/Call-Response-Statistics): \"In 2019 the Missoula Fire Department (MFD) responded to 8924 total calls for service. A little over 66% of the 2019 calls were for medical assistance and rescue while fire responses, hazardous materials response, false alarms and a variety of other calls made up the difference.\"\n\nI wish there was a deeper breakout of which fire department vehicles and how many staff respond to medical assistance calls.\n\nThere is a national issue with fire departments responding with multiple staff, vehicles and equipment to non-fire calls. It would be nice to see, prior to proposing a levy, that the City of Missoula did a deeper look at who and what responds to which calls and, based on data, perhaps revise who replies for which calls. Like doing triage:\n\nLevel 1: Mental health crisis, no threat to public safety. Send the Mobile Response Team (MRT).\n\nLevel 2: Mental health crisis, no threat to public safety,  minor medical assistance needed. Send in the MRT and Emergency Medical Services (EMS). (And one EMS truck, not the hook and ladder - hyperbole.)\n\nLevel 3: Mental health crisis, potential or actual threat to public safety. Send in the MRT, Emergency Medical Services (EMS) and Police Department PD.\n\nLevel 4: Medical emergency. Send EMS.\n\nLevel 5: Medical emergency with law enforcement needed (like a bad car crash on Reserve). Send EMS, PD and Fire Engine(s).\n\nEtc.\n\nWithout data, it's hard to know that the current response systems are the best ones. \n\n And without data, it's like staffing a downtown bar on a Tuesday night in February the same as it would be staffed on the Saturday night of Homecoming weekend.",
            "Same.",
            "https://www.theonion.com/libertarian-reluctantly-calls-fire-department-1819567309",
            "First responders are socialism now? Are you also out here protesting the police and calling for their defunding? You should then since it's sOCiaLiSM",
            "This is for the fire department and mobile support teams which actually replace the pigs.",
            "great question. \n\nOne was an out-of-state college dad, who bought the house for son and his roommates. \n\nOne was an out-of-state college dad, who bought the house for his son and his roommates.",
            "The three in my street that sold in the last 18 months…. Out of staters.  \n\n2 of the 3 are remote workers, one is a student at the U. Mommy and daddy bought the house and it’s now a party house full of students.  \n\nThe people that moved out:  older retired lady, small family, I didn’t know the 3rd.",
            "Before you got to town, we had flippers, most the time the only added value of the house was changing realtors. Prices pretty much doubled.",
            "MST *is* a part of the city fire department. It's a combination of Partnership Health Center specialists and MFD EMS personnel.",
            "You both are onto something. So RickyTicky, I read that Missoula Current article that you referenced. it is dated from the fall, which interestingly points out about how the Mobile Support Team was looking for funding from the crisis levy, which we all know failed. Now the request for funding is seemingly disguised as a Fire Dept levy? I’m sure the services go hand in hand, but I agree with y’all… mills need to focus on one thing, otherwise it’s not transparent enough for my vote.",
            "Well that's a very good idea.  Maybe obvious and overdue but great it's being implemented",
            "I've lived in either Missoula County or the City of Missoula for over 35 years. If I'm not mistaken, both the county and city have been controlled by the Democrats for at least that long. Considering the majority, by far, of my property tax dollars are used to pay for things locally, and they are not money going to the state, please explain to me how the Republicans are responsible for the property taxes we pay.",
            "Genuinely asking - how are the Republicans at fault for property tax increases?",
            "Republicans cut taxes and we have the largest surplus in years, hence your refund you should have just gotten. I believe state income taxes decreased from 6.9 to 5.9%. Read the letter from the Gov that you should have also just received. This assuming you were gainfully employed and paid state income taxes in 2022.",
            "Shouldn't property taxes of these new homes and growth automatically cover that though?",
            "You’d be wrong. Fire is first on scene for medical calls in many situations.",
            "Response times are down and coverage is extremely thin.",
            "Have you ever seen the Fire Dept respond to a medical call? I do frequently when I’m downtown. No fewer than two and often three units will respond to a single distressed bum on the street. It’s major overkill. Not saying the FD doesn’t do a great job—they do—but they also know how to work the system to generate the numbers that make it look like they’re insanely busy .",
            "And the sweet old lady sold to the highest bidder yet out of staters take the heat.",
            "The state should be taxing remote work income at a much higher rate, and using that money to offset property taxes and local spending demands. Like essential services like this.",
            "Fair enough, but it seems like they fall under every dept. including MPD. The Mobile team should just push for their own bond, it’d be more transparent.",
            "It isn’t ANYTHING if we don’t pay for it, tying it to fire isn’t appropriate, especially if it’s supposed to be an alternative intervention in the place of law enforcement.",
            "It’s not an attempt at being deceptive, it’s an attempt to get funding. The last mill failed so it was included on this one since the funding is badly needed and because it’s a fire department program.",
            "The Department of Revenue in Helena sets the value of every property, every two years. State government is very much controlled by Republicans. Taxable value and Market value should not be the same amount, but that’s where we’re headed.",
            "Right?",
            "Okay, hear me out on this one. Maaaybe every single incident doesn't require a 40 foot fire truck full of fire fighters AND and an ambulance with two EMT's. It certainly feels like there's a lot of time and money wasted with the current approach.",
            "*\"im jealous that I have to drive to work tax WFH more!\"*  \n\nSeriously all jokes aside why should someone get taxed more than you just because their job is different? \n\n Not because  they make more thats how tax brackets work, but simply their office is their house.  \n\n\n\nThats straight up ignorant if thats the case.",
            "Already happening. Montana is top 5 highest taxes for people making over 100k. Your outrage should be directed at how that tax money is spent.",
            "No it shouldn’t, I was born in Montana, I’ve always been a Montana resident, and I work remote to be able to afford to farm instead of developing my property.  Be careful what you wish for, nothing is stopping anyone in Montana from working remote, sitting around and complaining about remote work just because you don’t have the skills or opportunity to capitalize on this sea change in employment doesn’t mean we should punish people that do.",
            "It is deceptive because the voters rejected the program last year., but hey let’s  run it by the voters every year until it is approved.",
            "Lol, so the DoR is a partisan organization based on who controls the state house? So for the last 40 years they’ve been scheming this the whole time for 2023? Cmon gang this is a biiiiiiiit of a stretch, and no I’m not a Republican.",
            "I think the point being made here is that people are working remote jobs based in HCOL areas and then moving to LCOL areas and pricing locals out of the market. I mean, let's be real here: The out-of-staters who are moving in and paying cash 20% above asking price aren't wiping down tables at Taco del Sol... So the proximal answer to this question would be: To de-incentivize out-of-staters from doing what they've been doing the last 3 years and help stabilize the housing market.",
            "Let me make a quick distinction:\n\nTelecommuters who work in another state \n\nAnd people who work for a company in state \n\nAnd it has everything to do with a National housing market, and the inequality not taxing it perpetuates.",
            "By the way, I don’t have to drive to work. Lolz.",
            "We’re lower than Oregon, California, Washington, New York. We should tax according to the state where the income was made. There shouldn’t be a huge economic incentive to come here and raise prices.",
            "Our payroll tax maxes out at 5.9%, nowhere near top 5.",
            "Except I’d hypothetically still be entry level, and I’d be competing on the housing market with people in upper management. \n\nIt’s not punishing people to set the economic conditions such that a great many people aren’t displaced and houseless, so that  that other people can experience even more prosperity. You would still have every economic incentive to do what you did, and you would be able to budget around the like 5% reduction from taxes. \n\nBut it’s pretty clear what the remote work boom did to housing costs around here. It’s pretty clear when most new homes go to out of staters, and when housing prices doubled in two years. \n\nIt’s not punishing you to have a better, safer society.",
            "I mean, I understand that you don’t like it but it’s most certainly not deceptive. They’re being very up front about its inclusion, actively holding press events to explain what MST is and why it’s on the mill levy. The voters rejected it along with crisis services that mostly focused on the homeless population (MST works with the entire county, not just people on the streets). Now the voters have the choice to reject it again. This might not be a popular way to go about getting funding, but no one’s being dishonest about it.",
            "Let me guess…libertarian. 😂",
            "Shhh, don’t tell the “locals” that they can also just get a remote work job from a HCOL area…",
            "I get your point I really do and i want to be angry that i cannot afford a home or possibly ever retire, but thats what these corporate ass hats want you to do be angry at the average American. \n\nnow we are too busy arguing over BS like orange man and dumb politics, isnt this supposed to be the land of opportunities?  so what if someone wanted to pay more than their house is worth thats their right, the average American doesn't have that kind of  money to simply just buy what they want. Especially no one makeing less than 300k a year. \n\n\nWhy point a finger at the average American,  just look around the land is being scarfed up and than resold to us as rentals, take a look at what Blackrock owns here in MT, I have friends here that constantly get mailed offers 10 to 20 percent more than their house is worth. And you're right thats the issue.",
            "You got the right spirit but are confidently wrong you should look up how taxes work, especially state taxes on income.",
            "Thats why I said jokes aside, too bad it already went over your head.",
            "Setting up economic conditions for more people to prosper isn’t increasing taxes on one group of people to subsidize gov programs for other groups of people.  A flat tax would be setting up people to prosper.  Capping property tax increases would as well.",
            "I don’t think anything that Missoula does with my tax dollars provides a better safer society, so I’ll just go ahead and vote no on all the mills.  They are creating the crises they then want money to solve, I choose not to participate in that.",
            "Ooooh guess again!",
            "\"Well, have the poors tried not being poor? If they want more money, they should just get a different job that pays much more money. I can't believe they haven't thought of this!\"",
            "Who's angry? People are going to do what's best for themselves. As a society, all you can really do is build a system that incentivizes people to do things that build the strongest economy possible. It's really not any more complicated than that.\n\n> Why point a finger at the average American,  just look around the land is being scarfed up and than resold to us as rentals, take a look at what Blackrock owns here in MT, I have friends here that constantly get mailed offers 10 to 20 percent more than their house is worth\n\nThe two aren't mutually exclusive concepts. Remote workers from out of state HCOL areas AND absentee landlords can be contributing factors. That said, if you Google Blackrock's home ownership in MT, [this is the first article that pops up.](https://www.reuters.com/article/factcheck-bill-gates-farmland-blackrock-idUSL2N2WX208)",
            "If you have a point to make about an incredibly complex system like a tax code, you should just make it, instead of being arrogantly pedantic.",
            "It actually is, read some history.",
            "I’ll stick with my first answer, thanks.",
            "Neither of us have the patience to listen to me explain how taxes work, especially since you want to bring me down to your level of ignorance and then try to beat me with experience.",
            "This isn’t all that complicated of an issue, or broad of an issue. You probably used more words to say nothing, than to provide a basis to understand how I’m wrong."
        ]
    },
    {
        "title": "My Brother And His Girlfriend Lost Everything They Ever Built And Own From A Fire",
        "score": 73,
        "date": "08-01-2023",
        "url": "http://www.gofundme.com/f/home-completely-destroyed-mormon-creek-fire?utm_source=customer&utm_medium=copy_link&utm_campaign=p_lico+share-sheet",
        "num_comments": 36,
        "comments": [
            "I’m so sorry for their loss. Especially the cat, so devastating."
        ],
        "replies": [
            "I'm so sorry for your loss. Check with the YWCA and see if they can't get hotel vouchers to tie them over for a few days, that is if they have no where to stay.",
            "Yo I have a some women and men's clothing that is in good shape to donate depending on their style/what sizes they wear. I have some items for younger kids but I just donated a bunch of that stuff.\n\nFeel free to DM me and I'm happy to meet up and hand stuff off for free.",
            "[https://nbcmontana.com/weather/wildfires/couple-returns-to-burned-home-in-lolo-mormon-creek-fire-may-be-human-caused?fbclid=IwAR1L6nbFIipytuZRluJZOIqqHtZSWUHTfHGoZTHJG0bbMkyHYeYhvwUViUI](https://nbcmontana.com/weather/wildfires/couple-returns-to-burned-home-in-lolo-mormon-creek-fire-may-be-human-caused?fbclid=IwAR1L6nbFIipytuZRluJZOIqqHtZSWUHTfHGoZTHJG0bbMkyHYeYhvwUViUI)",
            "Wait didn't the news say one of them grew up in that trailer?",
            "Donated. I am so very sorry for your loss. This is awful :(",
            "There was insurance on the house per this article https://nbcmontana.com/weather/wildfires/couple-returns-to-burned-home-in-lolo-mormon-creek-fire-may-be-human-caused\n\nEDITED: my understanding is they were the renters - and did not have renter’s insurance. OP maybe clarify the post and GoFundMe if you can? Just since there is information that seems conflicting at first glance.",
            "Prayers",
            "Do you have insurance?",
            "I might be able to donate items if there is a way to do that.",
            "Call the Red Cross; they may already have contacted your brother at the time of the fire but if not, they do hotel vouchers",
            "Did they not have insurance?\n\nIf they are a renter the landlord has to find accommodations.  If they owned the house the insurance should put them up",
            "Set up a Go Fund Me page,  Prayers for their loss.",
            "I agree, she was the biggest loss. Materials can always just be replaced but she can’t.",
            "Thank you for the info, I will be sure to pass that information along to him.",
            "Personally wouldn't do anything with the YWCA. They just want money and for you to not be their issue anymore.",
            "This the news article",
            "They rent from family",
            "You are correct. They are renting from someone who owns an insured property without renter's insurance. That is why my mom started a fundraiser because they have lost everything. I am not being deceitful. I am simply trying to help my brother to the best of my ability with little information I've been provided. There is nothing here to debunk.",
            "No. It is not my house, is's my brothers house. He does not have insurance.",
            "This is not accurate. The home is uninhabitable, the lease has terminated due to the condition.",
            "My wife used to work for the Red Cross, this is one of the main things they help with so if they aren’t in touch with them yet please encourage them to reach out to the Red Cross.",
            "You don't lose any money just for asking, and I've been helped by YWCA throughout my childhood and adult life. They haven't taken a penny from us. They need donations for the people they serve in the community, because they are a non profit.",
            "Don't know why you're being down voted. It's commonly known to the people here in Missoula that have come into contact with the YWCA as a homeless person how toxic and awful that place is.",
            "gotcha, the news didn't do the best job on the report. Expectedthough.",
            "I’m very sorry to hear they lost everything.",
            "Is the article mistaken? It says in the article they do have insurance.",
            "[deleted]",
            "Did they not have rental insurance?  Also if the lease has ended then they are owed the partial month's rent and all of the deposit which should be in the thousands of dollars.\n\nThe story reads that it was his brother's house so that to me means he owned it",
            "And my family has been actively harmed by the ywca with false info and horrible housing leading to severe mental issues. So like I said personally wouldn't do anything with that greedy company. Half of my family was forced to move out of the state due to legal pressure from the YWCA. My personal negative experience is just as valid.",
            "It sucks that it happens, but that's not every experience. As I  said above, they've helped me and my family a lot. Thats why it doesn't hurt to ask. I've been and am homeless and they do help considerably. It depends on the person and their situation. You can disregard the positive experiences all you want, they still happen. They are one of the only non profits that specifically help women and families. So, if someone's house literally burns down and they need help, it doesn't hurt to ask.",
            "I believe the person they were renting from has insurance on the house",
            "Rental maybe?",
            "He was renting, I guess the owner of the house has insurance, they still lost everything they own.",
            "[deleted]",
            "They did not have renters insurance as per OP in comments and yes, rent rebate on any prepaid rent. Yesterday was the first. Who knows if they paid rent on time or not. Yes, refund of deposit is owed.",
            "S/ yeah don't ask the YWCA for help if your house burns down btw!",
            "Not if you may lose more because of policies and the way it's run. So glad you had a good experience, but people need to know the negative experiences too so they can make an informed judgment call."
        ]
    },
    {
        "title": "Fires",
        "score": 11,
        "date": "07-31-2023",
        "url": "https://www.reddit.com/r/missoula/comments/15e1izd/fires/",
        "num_comments": 22,
        "comments": [
            "I have been watching the tankers flying over Lolo, three “structures” impacted by that fire."
        ],
        "replies": [
            "We're driving back from polson now, and the big knife fire is massive. There is also another one out by Lake mary ronan/ Hot Springs.\nPlease help out anyone needing to be evacuated, and please help out fire fighters and give thanks when you see them.\nEdit: we saw 5 fires ranging in different sizes from just outside lakeside (rollins/hot springs) all the way to arlee.",
            "I’m honestly surprised it took until the end of July to see this.",
            "Mormon Creek near Lolo is on fire",
            "The fire to the north of us, burning by Arlee,  is the Big Knife fire. I don't know about the Lolo situation since it's not on any wildfire map I use.",
            "Was just at snowbowl. No fire there. Saw it coming back to town",
            "Montana summer",
            "There was a lightning storm Saturday night. \nSunday was hot and windy. \n\nThere were about 10 fires started between flathead lake and Lolo. Probably more east and west and further south. \n\nOur smoke free summer is over guys.",
            "Looks like neocon shill Tim Sheehy will be making some money with his tanker fleet.",
            "With all the fire posts here I was about to ask if this was everyone's first summer in Montana but I guess for a lot of people here it actually is. Hope you enjoyed the 4 weeks of Summer. Now it's smoke season. After that you've got a couple mild weeks of fall usually around the end of september until 7 straight months of Winter. Enjoy everybody!",
            "Currently looks like Snowbowl is on fire from my house...",
            "Seely right now",
            "mtfireinfo.org\n\nhttps://arcg.is/0z1TL8",
            "Oofda, ton of smoke. https://www.kpax.com/breaking-news-alerts/fire-burning-near-lolo-neighborhood-reaches-homes-and-other-structures",
            "[deleted]",
            "\"Why are you booing me,  I'm right\"",
            "That’s the big knife fire in Arlee",
            "Snowbowl is about 1/2 way to the Big Knife fire. It's amazing how close a plume that goes up over 30,000 feet looks. The fire is about 20 miles away from the edge of Missoula, 10 miles from Snowbowl but 3 drainages in between Snowbowl and Big Knife and the wind is blowing it in the opposite direction. \n\nIf they can't contain it, it will be over to Placid Lake before the fire season is over.",
            "Oh they’re evacuating now",
            "Yeah 20mph wind and 10% humidity, somebody farted I guess.",
            "The big smoke plume to the north is from the fire by Arlee, and it's essentially due north of campus by about 20 miles, so it makes sense that it looks like it's in the rattlesnake or by snowbowl. That fire as at over 750 acres.",
            "Good information, hope it's okay out there...",
            "Truth hurts"
        ]
    },
    {
        "title": "Another RV Fire",
        "score": 32,
        "date": "07-30-2023",
        "url": "https://i.redd.it/u0v996r0j0fb1.jpg",
        "num_comments": 18,
        "comments": [
            "Maybe people wouldn't have to live in shitty RVs if housing was even remotely affordable"
        ],
        "replies": [
            "What do you mean \"burnt to the ground\"?  That'll buff right out!",
            "I hope they’re ok",
            "“This seems to be a regular occurrence”\nNo. But it is RV season. \nThis is a classic case of confirmation bias.",
            "Shit, left the oven on.",
            "I saw it burning, a fireman paramedic came but no ambulance.  I did wonder why they needed a ladder truck. There were already 2 hose trucks there.",
            "I couldn’t agree more.",
            "Haha, yeah, those tires are good to go.",
            "No ambulance ever came, I don’t think anyone was inside.",
            "Haha, I’ve been here my whole life, I’ve never seen an RV burn down in town, there have been four that I know of this year. Also, these are old rundown RV’s that people are living in, this has nothing to do with “RV season”. These aren’t people on summer vacation.",
            "Sure it wasn't the curling iron?",
            "It’s so funny that someone already living in severe poverty now has lost the place they sleep.",
            "Better to send more than you need to a fire site than not enough.",
            "My guess is anticipating the fire spreading to the structure",
            "If you say so. Happens every summer.",
            "No, it doesn’t. We’ve never been inundated with people living in RV’s all over Missoula like this. You’re telling me 4 fires, and those are just the ones I’m aware of, is a normal occurrence in Missoula?",
            "[deleted]",
            "Don’t try to act all high and mighty, I understand confirmation bias. My degree is in neuroscience. You’re just using the term wrong in this case. \n\nConfirmation bias would mean that I hold some preexisting belief about an increase in RV fires. I had never thought about it before. There is nothing for the bias to confirm in this case.\n\nI’m reporting an observation about changing conditions. I think you might be confused.",
            "Wonderwhy is having an average redditor moment, you clearly are the one that’s misinformed"
        ]
    },
    {
        "title": "Big Knife Fire",
        "score": 68,
        "date": "07-25-2023",
        "url": "https://i.redd.it/11fdckhgb1eb1.jpg",
        "num_comments": 18,
        "comments": [
            "I’m surprised fire season hasn’t kicked off yet. It’s bound to happen sooner or later, and honestly some of the forests need it. The section around McDonald Lake is especially atrocious……"
        ],
        "replies": [
            "Unless I’m mistaken, this is a wildfire not a knife fire.",
            "I definitely don’t know enough about wildfires to know when it is a good thing.  I’ve been up to McDonald Lake a few times this summer and it’s pretty tough to get far on the trail.  Would be pretty scary to get stuck in a fire in the Missions, I feel SO alone when I’m out in the woods here.  Other than the grizzlies anyway.",
            "It’s here. Slower start than “normal”, but it’s here.",
            "I always mix the two up - sorry!",
            "Well, forests require fire to clear out overgrowth, clear out dead timber and to release seeds for new trees. If you’ve been to the lake then you know just how overgrown that area is. That is not a healthy forest. At all.",
            "The biggest fire in the state right now (to my knowledge) is just over 1.700 acres……I mean, I guess it’s here.",
            "Right - I just meant, I thought a prescribed burn would be better than an unplanned wildfire.  The forest / trails on the reservation don’t get much attention though.  I always assumed lack of funding.",
            "The Colt Fire over near Seeley Lake is nearly 4500 acres. Started about a week ago.",
            "Ah. Apologies, I misunderstood. I’d agree with you that a prescribed burn is better. I wouldn’t know why it hasn’t been done though.",
            "Ah. Then the online maps I was looking at were out of date. Thanks for the update",
            "Because it takes time, lots of money, people, almost perfect weather, and tooonns of planning WITH approval from so many different people/places/organizations. And CSKT doesn’t have that big of a fire or fuels program. \n\nSometimes you have to use unplanned fires to your advantage to mitigate some of that overgrowth.",
            "What site(s) are you using?",
            "They don’t let unplanned fires run their course though! That’s the frustrating aspect for me. There’s exceptions of course but they consistently put fires out as fast as possible.\n\nI get there are liability issues and resource constraints, but still.",
            "Fireweatheravalanche.org. Yesterday it was listed around 1,500 acres. Today it’s just under 3k acres",
            "The Governor is requiring all state protected lands be put out ASAP. The feds can still choose to “manage” fires federally protected fires, to an extent. Too many factors to list off as to what that extent is.",
            "That site updates from certain programs that can take time to update or for it to capture the updates. \n\nI would encourage you to take a look at Inciweb and to follow the local agencies on Facebook as well. Those are a little more real time as to the current situation.",
            "Thanks!"
        ]
    },
    {
        "title": "Fires while camp/floating on the Blackfoot River",
        "score": 3,
        "date": "05-19-2023",
        "url": "https://www.reddit.com/r/missoula/comments/13lh33g/fires_while_campfloating_on_the_blackfoot_river/",
        "num_comments": 17,
        "comments": [
            "Your options are basically (a) the big, standard firepan or (b) a much flimsier firepan that you only build very small fires in (generally only a backup in case your stove dies). Source: I'm a boater & this is a common river regulation."
        ],
        "replies": [
            "You can buy a really cheap and large aluminum type beer bucket thing at Walmart.  We've used them for years. They are high walled, cheap and light weight. You can have a fire way bigger than you should. Please pack out your ashes!",
            "Get one of those cheap round flat charcoal grills from Walmart. Don't put the legs on it but set it up on a circle of rocks to keep from scorching the sand",
            "I use the \"Wolf and Grizzly\" fire safe. Its amazing, collapsible and pretty light. I take it car camping, kayaking and backpacking. Not that expensive and you can get a good fire going on it.",
            "A couple years ago my dad called the FWP to plan our trip and he asked about a fire pan and they just straight up let us borrow one for free. Worth a shot just to call and ask.",
            "Rules are rules for a reason you best find a way to make it work",
            "My red wagon disappeared when I was a kid. I found it years later with the rafting stuff..",
            "Definitely planning to pack everything out. Thanks for the price efficient suggestion!",
            "This, you can also use a metal oil pan but prbly will only get one fire out of it. Pack out your ashes and use wag bags!",
            "Great idea!",
            "Great idea, thank you!",
            "Isnt that what they are doing by asking the question?",
            "We fully intend to follow the rules! Just looking for suggestions and perhaps ideas we hadn't thought of.",
            "Yep I use an oil pan for my Dutch oven. Here's another hack for it. I drilled holes and put four small biners around the lip of the oil pan. For rigging, I set the DO in the pan and crisscross a cam strap over the lid through the biners and slip the whole thing into a big dry bag. The oil pan protects the dry bag and other gear from the feet of the DO. Small bag of matchlight charcoal also goes in the dry bag. So in camp I have a separate little fire pan just for the Dutch oven.",
            "Can probably rent them as well from the U of M outdoor program or The Trailhead.",
            "We actually called Love Boat Paddle Co and will be renting from them. So many great ideas here if we end up needing a permanent suction for future trips."
        ]
    },
    {
        "title": "Smoke in Rattlesnake",
        "score": 0,
        "date": "05-04-2023",
        "url": "https://www.reddit.com/r/missoula/comments/137lyat/smoke_in_rattlesnake/",
        "num_comments": 8,
        "comments": [
            "https://www.kpax.com/news/missoula-county/prescribed-burn-planned-for-thusday-in-missoulas-pattee-canyon"
        ],
        "replies": [
            "Prescribed burning",
            "Its the whole valley now.  Hopefully we get a breeze to wash it out.",
            "Forest Service just did a prescribed burn on Strawberry Ridge (Wallman Trail) over the weekend and it is likley still smoldering. Should clear out pretty soon.",
            "How’re the trails looking over there?",
            "It's hazy out by Bonner too, and smells like fire season already. Can see the dark haze towards town like it's September.",
            "Is this still from Sunday?",
            "Lower trails are drying out pretty fast."
        ]
    },
    {
        "title": "Waterworks Hill fire?",
        "score": 11,
        "date": "04-30-2023",
        "url": "https://www.reddit.com/r/missoula/comments/1341a0e/waterworks_hill_fire/",
        "num_comments": 4,
        "comments": [
            "It is a prescribed burn in the rattlesnake"
        ],
        "replies": [
            "The best place to find info on prescribed burns is to go to the facebook page for individual forests. BLM Montana will also share info.\nhttps://www.facebook.com/lolonationalforest/posts/pfbid06CZbzBx15qdds63DDDiyDJvvtkD6W3Q9gSnLe87K5mopCiv6W6VYX8Ujkw847RVLl",
            "Might be getting spicy up there, a whole grip of wildland fire trucks just zoomed up Grant Cr.",
            "Yup, I went up and hiked it yesterday and saw signs warning of the controlled burn today"
        ]
    },
    {
        "title": "Nelson speaking fire",
        "score": 217,
        "date": "04-26-2023",
        "url": "https://i.redd.it/7eublgu1mbwa1.jpg",
        "num_comments": 80,
        "comments": [
            "Let me know when Judge Louden weighs in"
        ],
        "replies": [
            "This is the start of the Fanatical Theocracy the Republicans want",
            "Republicans want a small government - just big enough to fit in your bedroom, your womb, and in your family relationships.",
            "Christian extremists will be the death of our nation...",
            "[Stranger story](https://www.thestranger.com/news/2023/04/25/78964775/montana-wants-to-make-life-hell-for-trans-people)",
            "[deleted]",
            "If any of my fellow LGBTQ community members need help first-time shopping for means to defend themselves in this ever-more hostile world, let me know.",
            "Since when have politicians cared about the constitution? I love and respect the trans people I've had the chance to know. But I don't think recommending surgery and drugs  to teens is a intelligent solution.",
            "So it's unconstitutional to restrict the age that someone can medically transition? Does that mean it's unconstitutional to restrict the age that someone can drink? Drive? Vote? Buy a gun? Get a tattoo? Get married?",
            "[deleted]",
            "Absolutely fantastic !!!",
            "Politics are so cringe. If you support R or D. Congrats you're in a cult",
            "They don’t give a damn about the surrounding environment either",
            "Ha!  Not many will get this, but I do",
            "“Let-‘em-Loose” Louden!",
            "Ha ha Louden 😅",
            "This. It distracts their fucking rube constituents from the fact that they haven’t done anything meaningful to help them this session. Just rewarded their rich buddies and kicked downward at the marginalized",
            ">Hey we don't think you should mutilate children\n\nWow so extreme",
            "God bless them",
            "Holy shit, it's infuriating reading that article and human trash Reigers response. They are such snowflakes.",
            "Even if this does happen. It happens in very small and out there cases. The vast majority of trans kids are not getting surgery.\n\nI personally think those decision should be between a trained medical professional, a parent, and their child. \n\nIt’s propaganda to get you angry and it has worked. You fell for it.",
            "Was anyone trying to pass a bill that recommended or encouraged or required teens to transition?",
            "That's an unintelligent assessment of trans Healthcare issues. You're drinking Republicunt Kool-aid.",
            "I'm proud of Zooey for reminding them that they're killers.",
            "\nProud of what? Them being lying sacks of shit that don’t support our state’s constitution or democracy? Damn dude you’re a real champ.",
            "Fascists are generally proud of other fascists",
            "why does your right wing JesusGod care what other people do?",
            "You would be, since you’re a Nazi and all",
            "got it, lol",
            ">mutilate children \n\nGive us *one* example of that happening in Montana. One. It’s not happening. You’re lying because you want people angry and afraid. It’d be nothing more than a sad fact about you and your ideology except for the destructive effect it has on others.",
            "And yet Christians openly practice circumcision...",
            "Nobody's mutilating children, you're just making shit up.",
            "Nobody wants to mutilate children.  Please educate yourself, you sound ignorant as fuck.",
            "\"My religion is perfect and should supercede peoples rights because it's better(?) What do you mean I'm a stupid insular sheep who eats up my pastors own interpretation of the Bible like pigfeed no matter what he says?\"",
            "Stay in Canada, the state is full!",
            "That’s a lot of hate for Jesus.",
            "I guess I was simply propagandized when a family member of mine with mental illness became convinced they were trans and was given testosterone without her parents consent only to detransition a year later. Even though the whole family accepted her transition, she grew to be full of regret about what she had done to herself.\n\nThe truth is \"trained medical professionals\" aren't psychologists. They aren't trained on how to tackle trans patients and many young people are taking drastic medical actions without the proper guidance and support. \n\nIt's easy to virtue signal about how much of an ally you are to trans people. Its hard to make sure vulnerable people are properly protected and supported .",
            "Maybe instead of insulting me, you could explain to me why I'm wrong? Currently I do think recommending teenagers transition due to body image and identity issues is unwise. Especially since most teens struggle with those insecurities.",
            "Actually trans people are killed by trans people 99.9% of the time",
            "Redumblicans only vote the way they do to “own the libs” it’s basically that simple.",
            "If it's not happening why the big fuss about SB99? I'm guessing you're going to split hairs with the term mutilate. Me personally I consider permanently altering a child's hormones and stopping puberty mutilation but that's just me.",
            "Rules for thee, not for me.",
            "They still have a functioning penis at the end. Do you think getting a haircut is mutilation too?",
            "Preaching to the choir.  I'm fine where I am.",
            "So you’re proving my point. It DOES happen, which is what I said but that doesn’t mean that it is the norm.\n\nhttps://apnews.com/article/transgender-treatment-regret-detransition-371e927ec6e7a24cd9c77b5371c6ba2b#:~:text=In%20a%20review%20of%2027,surgeries%2C%20the%202021%20review%20said.\n\nYour family member was the exception. Not the rule.\n\nIf we ran our country on anecdotes we’d be screwed.",
            "If you spend any time watching the testimonies against these bills you would come across a bunch of medical and psychology associations that state the science stands with allowing teens to access this type of care.\n\nThe kids aren't thrown into taking hormones immediately. There is a lot of time spent in each case to ensure it's the best solution for the kid. The only ones claiming it's untested and doctors are doing surgery are the Republicans who are lying through their teeth so nobody questions why they're passing such hurtful bills for no reason. \n\nThe claims of surgery for minors is GOP propaganda and to be honest it doesn't take that much research to see that. At the bare minimum you should watch what the experts and trans people themselves are saying about who they are before you make judgements on what care we should receive.",
            "Where did you arrive at that statistic? Did God deliver the information in a vision?",
            "https://docs.google.com/document/u/1/d/e/2PACX-1vTFikAP6MXDCJjWzgMIOvpsT1ji-HwO-rLEvNE8e-cfCGh0YHoZluIG5TEsmwFub7MzIDfh0XgvcWL8/pub?fbclid=IwAR3mEG998_MrFpPwPCbAFbIXbr3jXs47GkyMTXDV-PmcUIDpD0oP-yzRq2M 😘",
            "When is someone gonna tell them the libs aren't owned?  It's not working.  They need a new motivation.",
            "You genuinely think someone walks into a clinic, says, \"Make my son a girl now, he learned another kid is trans and he wants to be a girl now.\" And walks out with HRT and schedules for surgery? You think it's that common and easy to do? Wherein reality, it involves child counseling and therapists, medical doctors, and parental involvement. \n\nNONE of the loud horrific noise in mainstream media about trans \"mutilation\" and \"forcing\" and \"sexualization\" of children is happening AT ALL, it's a culture war and current hateful fad of the christofascist right.",
            ">give us one example \n\nCrickets. Just man up and say you can’t, my guy. From reading your posts I know public humiliation is your kink but this is embarrassing.\n\nAlso if you have to redefine a word to make your point, it was a shit point to start",
            "Hormones literally cannot be permanently altered, for children or adults. Do your research before speaking. \n\nYou know what actually is mutilation? Forcing a puberty on trans kids that they don't desire.",
            "Do you consider antidepressants mutilation?  What about steroids for pain reduction?  Taking Tylenol for a headache is also altering your physiology.  There's a reason people under a certain age have different limits for medication, and with hormonal treatments it is no different.  These things don't get approved for use without rigorous studies to understand their risks and effects.  Do you think physicians are just handing it out like candy to whoever asks?   Just curious where you draw the line and why you're so focused on this particular medical treatment, which is just as well understood as any other.",
            "“Thou shalt love thy neighbour as thyself, *unless their ideals and lifestyle is not exactly like mine, because I’m right and they’re wrong.*” (Matthew 22:37–39)",
            "So you are going to try and compare genital mutilation with zero consent (usually the parents aren't even asked) to a haircut? Sounds like you've lost the narrative.",
            "You’re fucking dumb. Maybe you should quit posting on Reddit.",
            "What would you say to someone who has medically transistioned and can't turn back, but no longer wishes to be the gender they became? They're just an enomaly? A sacrifice? \n\nThis reasoning is idiotic and is why I'm not completely on board with the current mainstream thought on trans care.",
            "Bs I know someone who was given testosterone every week at 16 with little to no psychological evaluation and no parental approval.",
            "Nah, he's just trying to celebrate trans people's suicides because he has no class.",
            "He pulled the statistic out of his nether regions, like he always does.",
            "Forced by who? Nature?",
            "What planet do you live on where the parents aren't consented for a circumcision? That is not the norm at all. And surely you aren't so dense that you don't understand that a minor cosmetic procedure done for hygiene purposes is not equal to completely destroying the genitals and permanently altering the hormones of a child.",
            "Yes. For adults that made that decision those are the consequences. People make horrible life altering decisions every single day. \n\nShould there be a law for every single instance?",
            "In our hypersexualized and genderfied society, it is hard to make a informed choice or find dispassionate information to study if gender dysphoria is the root element, or if other factors are in play (abuse among others).  However, denying any opportunity is probably worse for the number of people denied access to it.",
            "and if that's true then the correct solution is to make sure we have boards available that can enforce standards of care for trans kids. It's not to revoke our medical care completely because it's life saving.\n\nThe bigger issue here is that people, who aren't trans and refuse to listen to us, want to use a miniscule amount of negative scenarios to label any form of care as problematic. Nobody tries to ban Chemotherapy when a person has a bad reaction to it.",
            "I just spent a few minutes reading through your comment history. You're pretty dumb. Just thought you should know that because you could actually change that about yourself with some education. I doubt you will, though. Because, again, you're pretty dumb.",
            "By people like you. Transphobes.",
            "> minor cosmetic procedure \n\nmyth, was never for cosmetic reasons\n\n>for hygiene purposes \n\nmyth, boys are clean and just as well fully intact\n\n>not equal to destroying the genitals \n\nIt has done so on thousands of occasions\n\n[Here's a quick look at your myths](https://intactamerica.org/newborn-male-circumcision-myths-facts-info/)",
            "What about the children who made that decision 🤔, the children who will have poor bone density, hair loss, and infertility in their futures. Can they consent to such a consequential decision?",
            "What the hell are you even saying? I try to understand where you guys are coming from but you seem to only value the opinions of those who completely agree with you. Like a damn cult",
            "I'm not arguing for a complete a ban on treatment. I just wish people would frame this issue more honestly on BOTH sides.  \n\nThoughtless endorsement for drastic medical care is idiotic and there needs to be reform to protect both trans youth and kids who are just confused.",
            "This is all he has. Literally just spends all day on Reddit screaming into the void.",
            "[deleted]",
            "[deleted]",
            "IIRC the total of cases that result in de-transing because of regret are only 0.3% of the bunch. The rest are either happy transitions (97%) or de-transing because of feeling forced to by family or society.\n\nI am also curious how you're not advocating for a complete ban when you said *\"But I don't think recommending surgery and drugs to teens is a intelligent solution.\"*\n\nWhat else do you call it when you block them from getting the medicine they need?\n\nAside from that it's not drastic. You don't understand what it's like to be trans and you have no idea how much suffering we go through in puberty. To be forced into the wrong body because others think you aren't mature enough to know yourself is ridiculous.\n\nI expressed traditional girl desires at age 3-4 and had wished I was a girl for as long as I can remember. We know who we are. We also know who we aren't and forcing kids to have to deal with trauma like that is just cruel. Especially when you're hurting so many in order to protect a few CIS kids.",
            ">2 degrees\n\nSandwich artist and what else? I have a hard time believing you got your GED",
            "You might be okay with that 1 in a hundred experiencing complete and total hell, I am not and it's completely ironic that trans advocates who want protection and rights for a tiny minority of the population are completely fine if some kids have horrific experiences they come to reget it's almost like you only care about your rights and protections not the rights of others. Which would give your demands for others to understand and empathize with  your beliefs no ground to stand on.",
            "So all of a sudden the kids don't matter to you when they're cis. Really shows where you're values lie.",
            "Hahaha oh man you zinged me so good! Where do you guys come up with this stuff 😂😂😂",
            "If that's all you're getting from the conversation then all I can say is lol. \n\nWhen the lives of a few CIS kids means more than hundreds or thousands of trans kids then yes...they do mean less. Because equating human life vs human life it makes more sense to pick the solution that helps more people.\n\nNow, that being said, ideally we would want to eliminate any kids from needing to de-trans. We would want to try and ensure each individual gets the best care and best outcome. That unfortunately isn't real life and so we have to make a decision. Do we do what's best for more people? Or do what's best for a minority that meets the requirements of being \"normal\" to the CIS majority? \n\nWhich is worth more in your eyes? If it's strictly numbers and the values of the individuals are equal it's a clear choice for allowing the medical care."
        ]
    },
    {
        "title": "Camper fire north of the freeway on reserve caused the smoke",
        "score": 82,
        "date": "02-27-2023",
        "url": "https://v.redd.it/d7fytywjnska1",
        "num_comments": 8,
        "comments": [
            "[deleted]"
        ],
        "replies": [
            "Bummer. That's probably someone's home. Hope everyone is ok.",
            "Someones meth lab just went belly up.",
            "Hello Portland.",
            "Taco Bell was extra spicy!",
            "Lol, good stuff...",
            "nope.",
            "Why are they downvoting you? You’re right!",
            "My thoughts, too."
        ]
    },
    {
        "title": "Back in 1835 my grandfather's brother Anthony played football for Denver Colorado University. Then he played for the University of Montana. He ended up being a Fire Chief for Denver Colorado.",
        "score": 45,
        "date": "01-22-2023",
        "url": "https://i.redd.it/bms5p2kl5fda1.jpg",
        "num_comments": 12,
        "comments": [
            "  1935?"
        ],
        "replies": [
            "Might want to verify that date.",
            "Hate to break it to you. But there was no University of Montana in 1835.",
            "Things that didn't exist in 1835:\n\n- The university\n- The state of Montana (or, for that matter, the territory)\n- Photography\n- Contemporary \"gridiron\" football\n- Any human being that has been alive in the last 70 years",
            "Wow 34 year before football was invented. Assuming 1935, my father would have been 1 years old. My grandpa 32. I'm 36, so it's weird thinking about it.",
            "1835 huh?? Was Jim Bridger on that team?",
            "Yeah OP said he made a typo.",
            "There was no Denver in 1835",
            "Louisiana purchase 1803.  Montana state university 1893.\nFirst liberal to learn about history..........",
            "In 2135 they’ll be like:\nThings that didn’t exist in Montana in 2023:\n\nThe 20 more universities\n\nThe Montana sky domes\n\nThe great malls of Montana\n\nThe bubble over Yellowstone to keep the temperature climate controlled to what it was like in the old days\n\nPalm trees in downtown Missoula with Christmas lights\n\nThing that has not changed: locals pissed at the hoarded of out of staters coming in.",
            "Where did op make the correction.?",
            "On the original post in the comments"
        ]
    },
    {
        "title": "Bad photo but anyone know what’s up with this fire?",
        "score": 40,
        "date": "10-21-2022",
        "url": "https://i.redd.it/6hpgb31042v91.jpg",
        "num_comments": 24,
        "comments": [
            "Probably prescribed burn before the weather change. DNRC has been going at it for the past few weeks."
        ],
        "replies": [
            "Gondor calls for aid!",
            "Yeah my guess is that’s a fire",
            "Marshall-Woods prescribed burn.",
            "Looks smoking hot tbh",
            "If anyone has been up Woods Gulch, it was still smoldering on Sunday near the top.",
            "It's burning stuff. Living it's best life.",
            "It appears to be burning.",
            "What's up?  The ambient temperature, probably.",
            "prescribed burn",
            "It’s a prescribed burn meant to help protect the community. Don’t panic.",
            "Gondor! Where was Gondor when the Westfold fell?",
            "The riders of Rohan are coming. BRB.",
            "I'll send some spoonfuls of love.  But I'm not getting out of bed.",
            "The beacons!!! Running....Breath.... breath..... breath.... gondor calls for our aid.... awkward silence.",
            "Yessssss",
            "I won't put my trust in the kingdom of Rohan.",
            "Oh coolio, thanks",
            "Cute username!!",
            "we're here for it",
            "Awww I already sold my house and bought a house ship :(",
            "Where was Gondor when our enemies closed in around us!?",
            "Eeee! Thnx!",
            "Where was Gon-- hmph. No, my lord u/MTCru5er. We are alone."
        ]
    },
    {
        "title": "Anyone else see the fireball in the sky?",
        "score": 18,
        "date": "10-19-2022",
        "url": "https://www.reddit.com/r/missoula/comments/y8bt9v/anyone_else_see_the_fireball_in_the_sky/",
        "num_comments": 15,
        "comments": [
            "There has been a lot of meteor activity on our side of earth this year. Might explain why nasa wants to make a meteor deflection unit."
        ],
        "replies": [
            "There's a great website where you can report fireballs and find out what other people have reported. I think this is the event you saw: https://fireball.amsmeteors.org/members/imo_view/event/2022/7087",
            "I saw it! So crazy. I thought it was a firework at first. We were driving on hwy 10 near the Wye.",
            "Orinoid meteor showers this week .",
            "I believe that can happen when a shooting star is literally aimed right at you from the outer atmosphere. As it burns up, it ignites & loses all of its mass (hopefully)",
            "I saw someone post on facebook about Halley's Comet the other day, but I figured they were trippin.  Was probably this.",
            "Oronoids meteors showers tonight and tomorrow",
            "But i see ufos all the time\nAnd off star like and fire like objects",
            "I glanced in the direction just at the perfect moment. Maybe it dropped down near by",
            "Happy cake day, man!",
            "Fun fact:  shooting stars don't really burn up at all.  Most of them are small enough upon entering the atmosphere that you would never notice where they landed (smaller than a pebble).  The \"flame\" is from the oxygen in the atmosphere being pushed so hard by the meteor moving at such a fast speed that the friction causes combustion until the speed is slowed down enough and it simply falls from the sky.",
            "Haley’s comet was here in 1986 and comes around  every 75 years or so and isn’t due for another pass until we’ll after I’m dead and gone. 😂",
            "Wow so we could randomly pick up a shooting star and not even know it?\n\nFreaking bad ass!! Thanks for this!",
            "Nah my guy is just a massive Shinedown fan",
            "Absolutely, it would be rare though.  Less than 2% of meteorites have been observed to fall, even fewer are collected.  The vast majority of them have a lot of iron, so they'll be attracted to a magnet.  Then from there, there are a few tests you can do to further identify them as a meteorite."
        ]
    }
]